garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q24.h
// Register: PORTWIN1
#define PORTWIN1 PORTWIN1
extern volatile unsigned char           PORTWIN1            __at(0x103);
#ifndef _LIB_BUILD
asm("PORTWIN1 equ 0103h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
        unsigned IN3                    :1;
    };
} PORTWIN1bits_t;
extern volatile PORTWIN1bits_t PORTWIN1bits __at(0x103);
// bitfield macros
#define _PORTWIN1_IN_POSN                                   0x0
#define _PORTWIN1_IN_POSITION                               0x0
#define _PORTWIN1_IN_SIZE                                   0x8
#define _PORTWIN1_IN_LENGTH                                 0x8
#define _PORTWIN1_IN_MASK                                   0xFF
#define _PORTWIN1_IN0_POSN                                  0x0
#define _PORTWIN1_IN0_POSITION                              0x0
#define _PORTWIN1_IN0_SIZE                                  0x1
#define _PORTWIN1_IN0_LENGTH                                0x1
#define _PORTWIN1_IN0_MASK                                  0x1
#define _PORTWIN1_IN1_POSN                                  0x1
#define _PORTWIN1_IN1_POSITION                              0x1
#define _PORTWIN1_IN1_SIZE                                  0x1
#define _PORTWIN1_IN1_LENGTH                                0x1
#define _PORTWIN1_IN1_MASK                                  0x2
#define _PORTWIN1_IN2_POSN                                  0x2
#define _PORTWIN1_IN2_POSITION                              0x2
#define _PORTWIN1_IN2_SIZE                                  0x1
#define _PORTWIN1_IN2_LENGTH                                0x1
#define _PORTWIN1_IN2_MASK                                  0x4
#define _PORTWIN1_IN3_POSN                                  0x3
#define _PORTWIN1_IN3_POSITION                              0x3
#define _PORTWIN1_IN3_SIZE                                  0x1
#define _PORTWIN1_IN3_LENGTH                                0x1
#define _PORTWIN1_IN3_MASK                                  0x8

// Register: PORTWIN2
#define PORTWIN2 PORTWIN2
extern volatile unsigned char           PORTWIN2            __at(0x104);
#ifndef _LIB_BUILD
asm("PORTWIN2 equ 0104h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
        unsigned IN3                    :1;
    };
} PORTWIN2bits_t;
extern volatile PORTWIN2bits_t PORTWIN2bits __at(0x104);
// bitfield macros
#define _PORTWIN2_IN_POSN                                   0x0
#define _PORTWIN2_IN_POSITION                               0x0
#define _PORTWIN2_IN_SIZE                                   0x8
#define _PORTWIN2_IN_LENGTH                                 0x8
#define _PORTWIN2_IN_MASK                                   0xFF
#define _PORTWIN2_IN0_POSN                                  0x0
#define _PORTWIN2_IN0_POSITION                              0x0
#define _PORTWIN2_IN0_SIZE                                  0x1
#define _PORTWIN2_IN0_LENGTH                                0x1
#define _PORTWIN2_IN0_MASK                                  0x1
#define _PORTWIN2_IN1_POSN                                  0x1
#define _PORTWIN2_IN1_POSITION                              0x1
#define _PORTWIN2_IN1_SIZE                                  0x1
#define _PORTWIN2_IN1_LENGTH                                0x1
#define _PORTWIN2_IN1_MASK                                  0x2
#define _PORTWIN2_IN2_POSN                                  0x2
#define _PORTWIN2_IN2_POSITION                              0x2
#define _PORTWIN2_IN2_SIZE                                  0x1
#define _PORTWIN2_IN2_LENGTH                                0x1
#define _PORTWIN2_IN2_MASK                                  0x4
#define _PORTWIN2_IN3_POSN                                  0x3
#define _PORTWIN2_IN3_POSITION                              0x3
#define _PORTWIN2_IN3_SIZE                                  0x1
#define _PORTWIN2_IN3_LENGTH                                0x1
#define _PORTWIN2_IN3_MASK                                  0x8

// Register: PORTWIN3
#define PORTWIN3 PORTWIN3
extern volatile unsigned char           PORTWIN3            __at(0x105);
#ifndef _LIB_BUILD
asm("PORTWIN3 equ 0105h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
        unsigned IN3                    :1;
    };
} PORTWIN3bits_t;
extern volatile PORTWIN3bits_t PORTWIN3bits __at(0x105);
// bitfield macros
#define _PORTWIN3_IN_POSN                                   0x0
#define _PORTWIN3_IN_POSITION                               0x0
#define _PORTWIN3_IN_SIZE                                   0x8
#define _PORTWIN3_IN_LENGTH                                 0x8
#define _PORTWIN3_IN_MASK                                   0xFF
#define _PORTWIN3_IN0_POSN                                  0x0
#define _PORTWIN3_IN0_POSITION                              0x0
#define _PORTWIN3_IN0_SIZE                                  0x1
#define _PORTWIN3_IN0_LENGTH                                0x1
#define _PORTWIN3_IN0_MASK                                  0x1
#define _PORTWIN3_IN1_POSN                                  0x1
#define _PORTWIN3_IN1_POSITION                              0x1
#define _PORTWIN3_IN1_SIZE                                  0x1
#define _PORTWIN3_IN1_LENGTH                                0x1
#define _PORTWIN3_IN1_MASK                                  0x2
#define _PORTWIN3_IN2_POSN                                  0x2
#define _PORTWIN3_IN2_POSITION                              0x2
#define _PORTWIN3_IN2_SIZE                                  0x1
#define _PORTWIN3_IN2_LENGTH                                0x1
#define _PORTWIN3_IN2_MASK                                  0x4
#define _PORTWIN3_IN3_POSN                                  0x3
#define _PORTWIN3_IN3_POSITION                              0x3
#define _PORTWIN3_IN3_SIZE                                  0x1
#define _PORTWIN3_IN3_LENGTH                                0x1
#define _PORTWIN3_IN3_MASK                                  0x8

// Register: PORTWIN4
#define PORTWIN4 PORTWIN4
extern volatile unsigned char           PORTWIN4            __at(0x106);
#ifndef _LIB_BUILD
asm("PORTWIN4 equ 0106h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
        unsigned IN3                    :1;
    };
} PORTWIN4bits_t;
extern volatile PORTWIN4bits_t PORTWIN4bits __at(0x106);
// bitfield macros
#define _PORTWIN4_IN_POSN                                   0x0
#define _PORTWIN4_IN_POSITION                               0x0
#define _PORTWIN4_IN_SIZE                                   0x8
#define _PORTWIN4_IN_LENGTH                                 0x8
#define _PORTWIN4_IN_MASK                                   0xFF
#define _PORTWIN4_IN0_POSN                                  0x0
#define _PORTWIN4_IN0_POSITION                              0x0
#define _PORTWIN4_IN0_SIZE                                  0x1
#define _PORTWIN4_IN0_LENGTH                                0x1
#define _PORTWIN4_IN0_MASK                                  0x1
#define _PORTWIN4_IN1_POSN                                  0x1
#define _PORTWIN4_IN1_POSITION                              0x1
#define _PORTWIN4_IN1_SIZE                                  0x1
#define _PORTWIN4_IN1_LENGTH                                0x1
#define _PORTWIN4_IN1_MASK                                  0x2
#define _PORTWIN4_IN2_POSN                                  0x2
#define _PORTWIN4_IN2_POSITION                              0x2
#define _PORTWIN4_IN2_SIZE                                  0x1
#define _PORTWIN4_IN2_LENGTH                                0x1
#define _PORTWIN4_IN2_MASK                                  0x4
#define _PORTWIN4_IN3_POSN                                  0x3
#define _PORTWIN4_IN3_POSITION                              0x3
#define _PORTWIN4_IN3_SIZE                                  0x1
#define _PORTWIN4_IN3_LENGTH                                0x1
#define _PORTWIN4_IN3_MASK                                  0x8

// Register: PORTWIN5
#define PORTWIN5 PORTWIN5
extern volatile unsigned char           PORTWIN5            __at(0x107);
#ifndef _LIB_BUILD
asm("PORTWIN5 equ 0107h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
        unsigned IN3                    :1;
    };
} PORTWIN5bits_t;
extern volatile PORTWIN5bits_t PORTWIN5bits __at(0x107);
// bitfield macros
#define _PORTWIN5_IN_POSN                                   0x0
#define _PORTWIN5_IN_POSITION                               0x0
#define _PORTWIN5_IN_SIZE                                   0x8
#define _PORTWIN5_IN_LENGTH                                 0x8
#define _PORTWIN5_IN_MASK                                   0xFF
#define _PORTWIN5_IN0_POSN                                  0x0
#define _PORTWIN5_IN0_POSITION                              0x0
#define _PORTWIN5_IN0_SIZE                                  0x1
#define _PORTWIN5_IN0_LENGTH                                0x1
#define _PORTWIN5_IN0_MASK                                  0x1
#define _PORTWIN5_IN1_POSN                                  0x1
#define _PORTWIN5_IN1_POSITION                              0x1
#define _PORTWIN5_IN1_SIZE                                  0x1
#define _PORTWIN5_IN1_LENGTH                                0x1
#define _PORTWIN5_IN1_MASK                                  0x2
#define _PORTWIN5_IN2_POSN                                  0x2
#define _PORTWIN5_IN2_POSITION                              0x2
#define _PORTWIN5_IN2_SIZE                                  0x1
#define _PORTWIN5_IN2_LENGTH                                0x1
#define _PORTWIN5_IN2_MASK                                  0x4
#define _PORTWIN5_IN3_POSN                                  0x3
#define _PORTWIN5_IN3_POSITION                              0x3
#define _PORTWIN5_IN3_SIZE                                  0x1
#define _PORTWIN5_IN3_LENGTH                                0x1
#define _PORTWIN5_IN3_MASK                                  0x8

// Register: PORTWIN6
#define PORTWIN6 PORTWIN6
extern volatile unsigned char           PORTWIN6            __at(0x108);
#ifndef _LIB_BUILD
asm("PORTWIN6 equ 0108h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
        unsigned IN3                    :1;
    };
} PORTWIN6bits_t;
