garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q24.h
extern volatile I2C2RXBbits_t I2C2RXBbits __at(0x29F);
// bitfield macros
#define _I2C2RXB_RXB_POSN                                   0x0
#define _I2C2RXB_RXB_POSITION                               0x0
#define _I2C2RXB_RXB_SIZE                                   0x8
#define _I2C2RXB_RXB_LENGTH                                 0x8
#define _I2C2RXB_RXB_MASK                                   0xFF

// Register: I2C2TXB
#define I2C2TXB I2C2TXB
extern volatile unsigned char           I2C2TXB             __at(0x2A0);
#ifndef _LIB_BUILD
asm("I2C2TXB equ 02A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} I2C2TXBbits_t;
extern volatile I2C2TXBbits_t I2C2TXBbits __at(0x2A0);
// bitfield macros
#define _I2C2TXB_TXB_POSN                                   0x0
#define _I2C2TXB_TXB_POSITION                               0x0
#define _I2C2TXB_TXB_SIZE                                   0x8
#define _I2C2TXB_TXB_LENGTH                                 0x8
#define _I2C2TXB_TXB_MASK                                   0xFF

// Register: I2C2CNT
#define I2C2CNT I2C2CNT
extern volatile unsigned short          I2C2CNT             __at(0x2A1);
#ifndef _LIB_BUILD
asm("I2C2CNT equ 02A1h");
#endif

// Register: I2C2CNTL
#define I2C2CNTL I2C2CNTL
extern volatile unsigned char           I2C2CNTL            __at(0x2A1);
#ifndef _LIB_BUILD
asm("I2C2CNTL equ 02A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT0                   :1;
        unsigned CNT1                   :1;
        unsigned CNT2                   :1;
        unsigned CNT3                   :1;
        unsigned CNT4                   :1;
        unsigned CNT5                   :1;
        unsigned CNT6                   :1;
        unsigned CNT7                   :1;
    };
    struct {
        unsigned I2C2CNT                :8;
    };
    struct {
        unsigned I2C2CNT0               :1;
        unsigned I2C2CNT1               :1;
        unsigned I2C2CNT2               :1;
        unsigned I2C2CNT3               :1;
        unsigned I2C2CNT4               :1;
        unsigned I2C2CNT5               :1;
        unsigned I2C2CNT6               :1;
        unsigned I2C2CNT7               :1;
    };
} I2C2CNTLbits_t;
extern volatile I2C2CNTLbits_t I2C2CNTLbits __at(0x2A1);
// bitfield macros
#define _I2C2CNTL_CNT_POSN                                  0x0
#define _I2C2CNTL_CNT_POSITION                              0x0
#define _I2C2CNTL_CNT_SIZE                                  0x8
#define _I2C2CNTL_CNT_LENGTH                                0x8
#define _I2C2CNTL_CNT_MASK                                  0xFF
#define _I2C2CNTL_CNT0_POSN                                 0x0
#define _I2C2CNTL_CNT0_POSITION                             0x0
#define _I2C2CNTL_CNT0_SIZE                                 0x1
#define _I2C2CNTL_CNT0_LENGTH                               0x1
#define _I2C2CNTL_CNT0_MASK                                 0x1
#define _I2C2CNTL_CNT1_POSN                                 0x1
#define _I2C2CNTL_CNT1_POSITION                             0x1
#define _I2C2CNTL_CNT1_SIZE                                 0x1
#define _I2C2CNTL_CNT1_LENGTH                               0x1
#define _I2C2CNTL_CNT1_MASK                                 0x2
#define _I2C2CNTL_CNT2_POSN                                 0x2
#define _I2C2CNTL_CNT2_POSITION                             0x2
#define _I2C2CNTL_CNT2_SIZE                                 0x1
#define _I2C2CNTL_CNT2_LENGTH                               0x1
#define _I2C2CNTL_CNT2_MASK                                 0x4
#define _I2C2CNTL_CNT3_POSN                                 0x3
#define _I2C2CNTL_CNT3_POSITION                             0x3
#define _I2C2CNTL_CNT3_SIZE                                 0x1
#define _I2C2CNTL_CNT3_LENGTH                               0x1
#define _I2C2CNTL_CNT3_MASK                                 0x8
#define _I2C2CNTL_CNT4_POSN                                 0x4
#define _I2C2CNTL_CNT4_POSITION                             0x4
#define _I2C2CNTL_CNT4_SIZE                                 0x1
#define _I2C2CNTL_CNT4_LENGTH                               0x1
#define _I2C2CNTL_CNT4_MASK                                 0x10
#define _I2C2CNTL_CNT5_POSN                                 0x5
#define _I2C2CNTL_CNT5_POSITION                             0x5
#define _I2C2CNTL_CNT5_SIZE                                 0x1
#define _I2C2CNTL_CNT5_LENGTH                               0x1
#define _I2C2CNTL_CNT5_MASK                                 0x20
#define _I2C2CNTL_CNT6_POSN                                 0x6
#define _I2C2CNTL_CNT6_POSITION                             0x6
#define _I2C2CNTL_CNT6_SIZE                                 0x1
#define _I2C2CNTL_CNT6_LENGTH                               0x1
#define _I2C2CNTL_CNT6_MASK                                 0x40
#define _I2C2CNTL_CNT7_POSN                                 0x7
#define _I2C2CNTL_CNT7_POSITION                             0x7
#define _I2C2CNTL_CNT7_SIZE                                 0x1
#define _I2C2CNTL_CNT7_LENGTH                               0x1
#define _I2C2CNTL_CNT7_MASK                                 0x80
#define _I2C2CNTL_I2C2CNT_POSN                              0x0
#define _I2C2CNTL_I2C2CNT_POSITION                          0x0
#define _I2C2CNTL_I2C2CNT_SIZE                              0x8
#define _I2C2CNTL_I2C2CNT_LENGTH                            0x8
#define _I2C2CNTL_I2C2CNT_MASK                              0xFF
#define _I2C2CNTL_I2C2CNT0_POSN                             0x0
#define _I2C2CNTL_I2C2CNT0_POSITION                         0x0
#define _I2C2CNTL_I2C2CNT0_SIZE                             0x1
#define _I2C2CNTL_I2C2CNT0_LENGTH                           0x1
#define _I2C2CNTL_I2C2CNT0_MASK                             0x1
#define _I2C2CNTL_I2C2CNT1_POSN                             0x1
#define _I2C2CNTL_I2C2CNT1_POSITION                         0x1
#define _I2C2CNTL_I2C2CNT1_SIZE                             0x1
#define _I2C2CNTL_I2C2CNT1_LENGTH                           0x1
#define _I2C2CNTL_I2C2CNT1_MASK                             0x2
#define _I2C2CNTL_I2C2CNT2_POSN                             0x2
#define _I2C2CNTL_I2C2CNT2_POSITION                         0x2
#define _I2C2CNTL_I2C2CNT2_SIZE                             0x1
#define _I2C2CNTL_I2C2CNT2_LENGTH                           0x1
#define _I2C2CNTL_I2C2CNT2_MASK                             0x4
#define _I2C2CNTL_I2C2CNT3_POSN                             0x3
#define _I2C2CNTL_I2C2CNT3_POSITION                         0x3
#define _I2C2CNTL_I2C2CNT3_SIZE                             0x1
#define _I2C2CNTL_I2C2CNT3_LENGTH                           0x1
#define _I2C2CNTL_I2C2CNT3_MASK                             0x8
#define _I2C2CNTL_I2C2CNT4_POSN                             0x4
#define _I2C2CNTL_I2C2CNT4_POSITION                         0x4
#define _I2C2CNTL_I2C2CNT4_SIZE                             0x1
#define _I2C2CNTL_I2C2CNT4_LENGTH                           0x1
#define _I2C2CNTL_I2C2CNT4_MASK                             0x10
#define _I2C2CNTL_I2C2CNT5_POSN                             0x5
#define _I2C2CNTL_I2C2CNT5_POSITION                         0x5
#define _I2C2CNTL_I2C2CNT5_SIZE                             0x1
#define _I2C2CNTL_I2C2CNT5_LENGTH                           0x1
#define _I2C2CNTL_I2C2CNT5_MASK                             0x20
#define _I2C2CNTL_I2C2CNT6_POSN                             0x6
#define _I2C2CNTL_I2C2CNT6_POSITION                         0x6
#define _I2C2CNTL_I2C2CNT6_SIZE                             0x1
#define _I2C2CNTL_I2C2CNT6_LENGTH                           0x1
#define _I2C2CNTL_I2C2CNT6_MASK                             0x40
#define _I2C2CNTL_I2C2CNT7_POSN                             0x7
#define _I2C2CNTL_I2C2CNT7_POSITION                         0x7
#define _I2C2CNTL_I2C2CNT7_SIZE                             0x1
#define _I2C2CNTL_I2C2CNT7_LENGTH                           0x1
#define _I2C2CNTL_I2C2CNT7_MASK                             0x80

// Register: I2C2CNTH
#define I2C2CNTH I2C2CNTH
extern volatile unsigned char           I2C2CNTH            __at(0x2A2);
#ifndef _LIB_BUILD
asm("I2C2CNTH equ 02A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT8                   :1;
        unsigned CNT9                   :1;
        unsigned CNT10                  :1;
        unsigned CNT11                  :1;
        unsigned CNT12                  :1;
        unsigned CNT13                  :1;
        unsigned CNT14                  :1;
        unsigned CNT15                  :1;
    };
    struct {
        unsigned I2C2CNT                :8;
    };
    struct {
        unsigned I2C2CNT8               :1;
        unsigned I2C2CNT9               :1;
        unsigned I2C2CNT10              :1;
        unsigned I2C2CNT11              :1;
        unsigned I2C2CNT12              :1;
        unsigned I2C2CNT13              :1;
        unsigned I2C2CNT14              :1;
        unsigned I2C2CNT15              :1;
    };
} I2C2CNTHbits_t;
