garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q24.h
#define                                 D1S5_bit            _BIT_ACCESS(CLCnSEL0,5)
// CLCnSEL1<D2S0>
extern volatile __bit                   D2S0                __at(0x6C8);	// @ (0xD9 * 8 + 0)
#define                                 D2S0_bit            _BIT_ACCESS(CLCnSEL1,0)
// CLCnSEL1<D2S1>
extern volatile __bit                   D2S1                __at(0x6C9);	// @ (0xD9 * 8 + 1)
#define                                 D2S1_bit            _BIT_ACCESS(CLCnSEL1,1)
// CLCnSEL1<D2S2>
extern volatile __bit                   D2S2                __at(0x6CA);	// @ (0xD9 * 8 + 2)
#define                                 D2S2_bit            _BIT_ACCESS(CLCnSEL1,2)
// CLCnSEL1<D2S3>
extern volatile __bit                   D2S3                __at(0x6CB);	// @ (0xD9 * 8 + 3)
#define                                 D2S3_bit            _BIT_ACCESS(CLCnSEL1,3)
// CLCnSEL1<D2S4>
extern volatile __bit                   D2S4                __at(0x6CC);	// @ (0xD9 * 8 + 4)
#define                                 D2S4_bit            _BIT_ACCESS(CLCnSEL1,4)
// CLCnSEL1<D2S5>
extern volatile __bit                   D2S5                __at(0x6CD);	// @ (0xD9 * 8 + 5)
#define                                 D2S5_bit            _BIT_ACCESS(CLCnSEL1,5)
// CLCnSEL2<D3S0>
extern volatile __bit                   D3S0                __at(0x6D0);	// @ (0xDA * 8 + 0)
#define                                 D3S0_bit            _BIT_ACCESS(CLCnSEL2,0)
// CLCnSEL2<D3S1>
extern volatile __bit                   D3S1                __at(0x6D1);	// @ (0xDA * 8 + 1)
#define                                 D3S1_bit            _BIT_ACCESS(CLCnSEL2,1)
// CLCnSEL2<D3S2>
extern volatile __bit                   D3S2                __at(0x6D2);	// @ (0xDA * 8 + 2)
#define                                 D3S2_bit            _BIT_ACCESS(CLCnSEL2,2)
// CLCnSEL2<D3S3>
extern volatile __bit                   D3S3                __at(0x6D3);	// @ (0xDA * 8 + 3)
#define                                 D3S3_bit            _BIT_ACCESS(CLCnSEL2,3)
// CLCnSEL2<D3S4>
extern volatile __bit                   D3S4                __at(0x6D4);	// @ (0xDA * 8 + 4)
#define                                 D3S4_bit            _BIT_ACCESS(CLCnSEL2,4)
// CLCnSEL2<D3S5>
extern volatile __bit                   D3S5                __at(0x6D5);	// @ (0xDA * 8 + 5)
#define                                 D3S5_bit            _BIT_ACCESS(CLCnSEL2,5)
// CLCnSEL3<D4S0>
extern volatile __bit                   D4S0                __at(0x6D8);	// @ (0xDB * 8 + 0)
#define                                 D4S0_bit            _BIT_ACCESS(CLCnSEL3,0)
// CLCnSEL3<D4S1>
extern volatile __bit                   D4S1                __at(0x6D9);	// @ (0xDB * 8 + 1)
#define                                 D4S1_bit            _BIT_ACCESS(CLCnSEL3,1)
// CLCnSEL3<D4S2>
extern volatile __bit                   D4S2                __at(0x6DA);	// @ (0xDB * 8 + 2)
#define                                 D4S2_bit            _BIT_ACCESS(CLCnSEL3,2)
// CLCnSEL3<D4S3>
extern volatile __bit                   D4S3                __at(0x6DB);	// @ (0xDB * 8 + 3)
#define                                 D4S3_bit            _BIT_ACCESS(CLCnSEL3,3)
// CLCnSEL3<D4S4>
extern volatile __bit                   D4S4                __at(0x6DC);	// @ (0xDB * 8 + 4)
#define                                 D4S4_bit            _BIT_ACCESS(CLCnSEL3,4)
// CLCnSEL3<D4S5>
extern volatile __bit                   D4S5                __at(0x6DD);	// @ (0xDB * 8 + 5)
#define                                 D4S5_bit            _BIT_ACCESS(CLCnSEL3,5)
// DAC1CON<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x3FF);	// @ (0x7F * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON,7)
// PMD2<DAC1MD>
extern volatile __bit                   DAC1MD              __at(0x322);	// @ (0x64 * 8 + 2)
#define                                 DAC1MD_bit          _BIT_ACCESS(PMD2,2)
// DAC1CON<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x3FA);	// @ (0x7F * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON,2)
// DAC1CON<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x3FB);	// @ (0x7F * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON,3)
// DAC1DATL<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x3E8);	// @ (0x7D * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1DATL,0)
// DAC1DATL<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x3E9);	// @ (0x7D * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1DATL,1)
// DAC1DATL<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x3EA);	// @ (0x7D * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1DATL,2)
// DAC1DATL<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x3EB);	// @ (0x7D * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1DATL,3)
// DAC1DATL<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x3EC);	// @ (0x7D * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1DATL,4)
// DAC1DATL<DAC1R5>
extern volatile __bit                   DAC1R5              __at(0x3ED);	// @ (0x7D * 8 + 5)
#define                                 DAC1R5_bit          _BIT_ACCESS(DAC1DATL,5)
// DAC1DATL<DAC1R6>
extern volatile __bit                   DAC1R6              __at(0x3EE);	// @ (0x7D * 8 + 6)
#define                                 DAC1R6_bit          _BIT_ACCESS(DAC1DATL,6)
// DAC1DATL<DAC1R7>
extern volatile __bit                   DAC1R7              __at(0x3EF);	// @ (0x7D * 8 + 7)
#define                                 DAC1R7_bit          _BIT_ACCESS(DAC1DATL,7)
// CRCDATAL<DATA0>
extern volatile __bit                   DATA0               __at(0x1A70);	// @ (0x34E * 8 + 0)
#define                                 DATA0_bit           _BIT_ACCESS(CRCDATAL,0)
// CRCDATAL<DATA1>
extern volatile __bit                   DATA1               __at(0x1A71);	// @ (0x34E * 8 + 1)
#define                                 DATA1_bit           _BIT_ACCESS(CRCDATAL,1)
// CRCDATAH<DATA10>
extern volatile __bit                   DATA10              __at(0x1A7A);	// @ (0x34F * 8 + 2)
#define                                 DATA10_bit          _BIT_ACCESS(CRCDATAH,2)
// CRCDATAH<DATA11>
extern volatile __bit                   DATA11              __at(0x1A7B);	// @ (0x34F * 8 + 3)
#define                                 DATA11_bit          _BIT_ACCESS(CRCDATAH,3)
// CRCDATAH<DATA12>
extern volatile __bit                   DATA12              __at(0x1A7C);	// @ (0x34F * 8 + 4)
#define                                 DATA12_bit          _BIT_ACCESS(CRCDATAH,4)
// CRCDATAH<DATA13>
extern volatile __bit                   DATA13              __at(0x1A7D);	// @ (0x34F * 8 + 5)
#define                                 DATA13_bit          _BIT_ACCESS(CRCDATAH,5)
// CRCDATAH<DATA14>
extern volatile __bit                   DATA14              __at(0x1A7E);	// @ (0x34F * 8 + 6)
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATAH,6)
// CRCDATAH<DATA15>
extern volatile __bit                   DATA15              __at(0x1A7F);	// @ (0x34F * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATAH,7)
// CRCDATAU<DATA16>
extern volatile __bit                   DATA16              __at(0x1A80);	// @ (0x350 * 8 + 0)
#define                                 DATA16_bit          _BIT_ACCESS(CRCDATAU,0)
// CRCDATAU<DATA17>
extern volatile __bit                   DATA17              __at(0x1A81);	// @ (0x350 * 8 + 1)
#define                                 DATA17_bit          _BIT_ACCESS(CRCDATAU,1)
// CRCDATAU<DATA18>
extern volatile __bit                   DATA18              __at(0x1A82);	// @ (0x350 * 8 + 2)
#define                                 DATA18_bit          _BIT_ACCESS(CRCDATAU,2)
// CRCDATAU<DATA19>
extern volatile __bit                   DATA19              __at(0x1A83);	// @ (0x350 * 8 + 3)
#define                                 DATA19_bit          _BIT_ACCESS(CRCDATAU,3)
// CRCDATAL<DATA2>
extern volatile __bit                   DATA2               __at(0x1A72);	// @ (0x34E * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATAL,2)
// CRCDATAU<DATA20>
extern volatile __bit                   DATA20              __at(0x1A84);	// @ (0x350 * 8 + 4)
#define                                 DATA20_bit          _BIT_ACCESS(CRCDATAU,4)
// CRCDATAU<DATA21>
extern volatile __bit                   DATA21              __at(0x1A85);	// @ (0x350 * 8 + 5)
#define                                 DATA21_bit          _BIT_ACCESS(CRCDATAU,5)
// CRCDATAU<DATA22>
extern volatile __bit                   DATA22              __at(0x1A86);	// @ (0x350 * 8 + 6)
#define                                 DATA22_bit          _BIT_ACCESS(CRCDATAU,6)
// CRCDATAU<DATA23>
extern volatile __bit                   DATA23              __at(0x1A87);	// @ (0x350 * 8 + 7)
#define                                 DATA23_bit          _BIT_ACCESS(CRCDATAU,7)
// CRCDATAT<DATA24>
extern volatile __bit                   DATA24              __at(0x1A88);	// @ (0x351 * 8 + 0)
#define                                 DATA24_bit          _BIT_ACCESS(CRCDATAT,0)
// CRCDATAT<DATA25>
extern volatile __bit                   DATA25              __at(0x1A89);	// @ (0x351 * 8 + 1)
#define                                 DATA25_bit          _BIT_ACCESS(CRCDATAT,1)
// CRCDATAT<DATA26>
extern volatile __bit                   DATA26              __at(0x1A8A);	// @ (0x351 * 8 + 2)
#define                                 DATA26_bit          _BIT_ACCESS(CRCDATAT,2)
// CRCDATAT<DATA27>
extern volatile __bit                   DATA27              __at(0x1A8B);	// @ (0x351 * 8 + 3)
#define                                 DATA27_bit          _BIT_ACCESS(CRCDATAT,3)
// CRCDATAT<DATA28>
extern volatile __bit                   DATA28              __at(0x1A8C);	// @ (0x351 * 8 + 4)
#define                                 DATA28_bit          _BIT_ACCESS(CRCDATAT,4)
// CRCDATAT<DATA29>
extern volatile __bit                   DATA29              __at(0x1A8D);	// @ (0x351 * 8 + 5)
#define                                 DATA29_bit          _BIT_ACCESS(CRCDATAT,5)
// CRCDATAL<DATA3>
extern volatile __bit                   DATA3               __at(0x1A73);	// @ (0x34E * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATAL,3)
// CRCDATAT<DATA30>
extern volatile __bit                   DATA30              __at(0x1A8E);	// @ (0x351 * 8 + 6)
#define                                 DATA30_bit          _BIT_ACCESS(CRCDATAT,6)
// CRCDATAT<DATA31>
extern volatile __bit                   DATA31              __at(0x1A8F);	// @ (0x351 * 8 + 7)
#define                                 DATA31_bit          _BIT_ACCESS(CRCDATAT,7)
// CRCDATAL<DATA4>
extern volatile __bit                   DATA4               __at(0x1A74);	// @ (0x34E * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATAL,4)
// CRCDATAL<DATA5>
extern volatile __bit                   DATA5               __at(0x1A75);	// @ (0x34E * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATAL,5)
// CRCDATAL<DATA6>
extern volatile __bit                   DATA6               __at(0x1A76);	// @ (0x34E * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATAL,6)
// CRCDATAL<DATA7>
extern volatile __bit                   DATA7               __at(0x1A77);	// @ (0x34E * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATAL,7)
// CRCDATAH<DATA8>
extern volatile __bit                   DATA8               __at(0x1A78);	// @ (0x34F * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATAH,0)
// CRCDATAH<DATA9>
extern volatile __bit                   DATA9               __at(0x1A79);	// @ (0x34F * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATAH,1)
// CWG1DBF<DBF0>
extern volatile __bit                   DBF0                __at(0x1DF8);	// @ (0x3BF * 8 + 0)
#define                                 DBF0_bit            _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<DBF1>
extern volatile __bit                   DBF1                __at(0x1DF9);	// @ (0x3BF * 8 + 1)
#define                                 DBF1_bit            _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<DBF2>
extern volatile __bit                   DBF2                __at(0x1DFA);	// @ (0x3BF * 8 + 2)
#define                                 DBF2_bit            _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<DBF3>
extern volatile __bit                   DBF3                __at(0x1DFB);	// @ (0x3BF * 8 + 3)
#define                                 DBF3_bit            _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<DBF4>
extern volatile __bit                   DBF4                __at(0x1DFC);	// @ (0x3BF * 8 + 4)
#define                                 DBF4_bit            _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<DBF5>
extern volatile __bit                   DBF5                __at(0x1DFD);	// @ (0x3BF * 8 + 5)
#define                                 DBF5_bit            _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<DBR0>
extern volatile __bit                   DBR0                __at(0x1DF0);	// @ (0x3BE * 8 + 0)
#define                                 DBR0_bit            _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<DBR1>
extern volatile __bit                   DBR1                __at(0x1DF1);	// @ (0x3BE * 8 + 1)
#define                                 DBR1_bit            _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<DBR2>
extern volatile __bit                   DBR2                __at(0x1DF2);	// @ (0x3BE * 8 + 2)
#define                                 DBR2_bit            _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<DBR3>
extern volatile __bit                   DBR3                __at(0x1DF3);	// @ (0x3BE * 8 + 3)
#define                                 DBR3_bit            _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<DBR4>
extern volatile __bit                   DBR4                __at(0x1DF4);	// @ (0x3BE * 8 + 4)
#define                                 DBR4_bit            _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<DBR5>
extern volatile __bit                   DBR5                __at(0x1DF5);	// @ (0x3BE * 8 + 5)
#define                                 DBR5_bit            _BIT_ACCESS(CWG1DBR,5)
// CLKRCON<DC0>
extern volatile __bit                   DC0                 __at(0x1D3);	// @ (0x3A * 8 + 3)
#define                                 DC0_bit             _BIT_ACCESS(CLKRCON,3)
// CLKRCON<DC1>
extern volatile __bit                   DC1                 __at(0x1D4);	// @ (0x3A * 8 + 4)
#define                                 DC1_bit             _BIT_ACCESS(CLKRCON,4)
// DMAnDCNTL<DCNT0>
extern volatile __bit                   DCNT0               __at(0x748);	// @ (0xE9 * 8 + 0)
#define                                 DCNT0_bit           _BIT_ACCESS(DMAnDCNTL,0)
// DMAnDCNTL<DCNT1>
extern volatile __bit                   DCNT1               __at(0x749);	// @ (0xE9 * 8 + 1)
#define                                 DCNT1_bit           _BIT_ACCESS(DMAnDCNTL,1)
// DMAnDCNTH<DCNT10>
extern volatile __bit                   DCNT10              __at(0x752);	// @ (0xEA * 8 + 2)
#define                                 DCNT10_bit          _BIT_ACCESS(DMAnDCNTH,2)
// DMAnDCNTH<DCNT11>
extern volatile __bit                   DCNT11              __at(0x753);	// @ (0xEA * 8 + 3)
#define                                 DCNT11_bit          _BIT_ACCESS(DMAnDCNTH,3)
// DMAnDCNTL<DCNT2>
extern volatile __bit                   DCNT2               __at(0x74A);	// @ (0xE9 * 8 + 2)
#define                                 DCNT2_bit           _BIT_ACCESS(DMAnDCNTL,2)
// DMAnDCNTL<DCNT3>
extern volatile __bit                   DCNT3               __at(0x74B);	// @ (0xE9 * 8 + 3)
#define                                 DCNT3_bit           _BIT_ACCESS(DMAnDCNTL,3)
// DMAnDCNTL<DCNT4>
extern volatile __bit                   DCNT4               __at(0x74C);	// @ (0xE9 * 8 + 4)
#define                                 DCNT4_bit           _BIT_ACCESS(DMAnDCNTL,4)
// DMAnDCNTL<DCNT5>
extern volatile __bit                   DCNT5               __at(0x74D);	// @ (0xE9 * 8 + 5)
#define                                 DCNT5_bit           _BIT_ACCESS(DMAnDCNTL,5)
// DMAnDCNTL<DCNT6>
extern volatile __bit                   DCNT6               __at(0x74E);	// @ (0xE9 * 8 + 6)
#define                                 DCNT6_bit           _BIT_ACCESS(DMAnDCNTL,6)
// DMAnDCNTL<DCNT7>
extern volatile __bit                   DCNT7               __at(0x74F);	// @ (0xE9 * 8 + 7)
#define                                 DCNT7_bit           _BIT_ACCESS(DMAnDCNTL,7)
// DMAnDCNTH<DCNT8>
extern volatile __bit                   DCNT8               __at(0x750);	// @ (0xEA * 8 + 0)
#define                                 DCNT8_bit           _BIT_ACCESS(DMAnDCNTH,0)
// DMAnDCNTH<DCNT9>
extern volatile __bit                   DCNT9               __at(0x751);	// @ (0xEA * 8 + 1)
#define                                 DCNT9_bit           _BIT_ACCESS(DMAnDCNTH,1)
// PORTWDF<DF0>
extern volatile __bit                   DF0                 __at(0x858);	// @ (0x10B * 8 + 0)
#define                                 DF0_bit             _BIT_ACCESS(PORTWDF,0)
// PORTWDF<DF1>
extern volatile __bit                   DF1                 __at(0x859);	// @ (0x10B * 8 + 1)
#define                                 DF1_bit             _BIT_ACCESS(PORTWDF,1)
// PORTWDF<DF2>
extern volatile __bit                   DF2                 __at(0x85A);	// @ (0x10B * 8 + 2)
#define                                 DF2_bit             _BIT_ACCESS(PORTWDF,2)
// PORTWDF<DF3>
extern volatile __bit                   DF3                 __at(0x85B);	// @ (0x10B * 8 + 3)
#define                                 DF3_bit             _BIT_ACCESS(PORTWDF,3)
// PORTWDF<DF4>
extern volatile __bit                   DF4                 __at(0x85C);	// @ (0x10B * 8 + 4)
#define                                 DF4_bit             _BIT_ACCESS(PORTWDF,4)
// PORTWDF<DF5>
extern volatile __bit                   DF5                 __at(0x85D);	// @ (0x10B * 8 + 5)
#define                                 DF5_bit             _BIT_ACCESS(PORTWDF,5)
// PORTWDF<DF6>
extern volatile __bit                   DF6                 __at(0x85E);	// @ (0x10B * 8 + 6)
#define                                 DF6_bit             _BIT_ACCESS(PORTWDF,6)
// PORTWDF<DF7>
extern volatile __bit                   DF7                 __at(0x85F);	// @ (0x10B * 8 + 7)
#define                                 DF7_bit             _BIT_ACCESS(PORTWDF,7)
// DMAnCON0<DGO>
extern volatile __bit                   DGO                 __at(0x7DD);	// @ (0xFB * 8 + 5)
#define                                 DGO_bit             _BIT_ACCESS(DMAnCON0,5)
// CLKRCON<DIV0>
extern volatile __bit                   DIV0                __at(0x1D0);	// @ (0x3A * 8 + 0)
#define                                 DIV0_bit            _BIT_ACCESS(CLKRCON,0)
// CLKRCON<DIV1>
extern volatile __bit                   DIV1                __at(0x1D1);	// @ (0x3A * 8 + 1)
#define                                 DIV1_bit            _BIT_ACCESS(CLKRCON,1)
// CLKRCON<DIV2>
extern volatile __bit                   DIV2                __at(0x1D2);	// @ (0x3A * 8 + 2)
#define                                 DIV2_bit            _BIT_ACCESS(CLKRCON,2)
// CRCCON2<DLEN0>
extern volatile __bit                   DLEN0               __at(0x1AC0);	// @ (0x358 * 8 + 0)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON2,0)
// CRCCON2<DLEN1>
extern volatile __bit                   DLEN1               __at(0x1AC1);	// @ (0x358 * 8 + 1)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON2,1)
// CRCCON2<DLEN2>
extern volatile __bit                   DLEN2               __at(0x1AC2);	// @ (0x358 * 8 + 2)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON2,2)
// CRCCON2<DLEN3>
extern volatile __bit                   DLEN3               __at(0x1AC3);	// @ (0x358 * 8 + 3)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON2,3)
// CRCCON2<DLEN4>
extern volatile __bit                   DLEN4               __at(0x1AC4);	// @ (0x358 * 8 + 4)
#define                                 DLEN4_bit           _BIT_ACCESS(CRCCON2,4)
// PIE2<DMA1AIE>
extern volatile __bit                   DMA1AIE             __at(0x2567);	// @ (0x4AC * 8 + 7)
#define                                 DMA1AIE_bit         _BIT_ACCESS(PIE2,7)
// PIR2<DMA1AIF>
extern volatile __bit                   DMA1AIF             __at(0x25C7);	// @ (0x4B8 * 8 + 7)
#define                                 DMA1AIF_bit         _BIT_ACCESS(PIR2,7)
// IPR2<DMA1AIP>
extern volatile __bit                   DMA1AIP             __at(0x2507);	// @ (0x4A0 * 8 + 7)
#define                                 DMA1AIP_bit         _BIT_ACCESS(IPR2,7)
// PIE2<DMA1DCNTIE>
extern volatile __bit                   DMA1DCNTIE          __at(0x2565);	// @ (0x4AC * 8 + 5)
#define                                 DMA1DCNTIE_bit      _BIT_ACCESS(PIE2,5)
// PIR2<DMA1DCNTIF>
extern volatile __bit                   DMA1DCNTIF          __at(0x25C5);	// @ (0x4B8 * 8 + 5)
#define                                 DMA1DCNTIF_bit      _BIT_ACCESS(PIR2,5)
// IPR2<DMA1DCNTIP>
extern volatile __bit                   DMA1DCNTIP          __at(0x2505);	// @ (0x4A0 * 8 + 5)
#define                                 DMA1DCNTIP_bit      _BIT_ACCESS(IPR2,5)
// PMD4<DMA1MD>
extern volatile __bit                   DMA1MD              __at(0x335);	// @ (0x66 * 8 + 5)
#define                                 DMA1MD_bit          _BIT_ACCESS(PMD4,5)
// PIE2<DMA1ORIE>
extern volatile __bit                   DMA1ORIE            __at(0x2566);	// @ (0x4AC * 8 + 6)
#define                                 DMA1ORIE_bit        _BIT_ACCESS(PIE2,6)
// PIR2<DMA1ORIF>
extern volatile __bit                   DMA1ORIF            __at(0x25C6);	// @ (0x4B8 * 8 + 6)
#define                                 DMA1ORIF_bit        _BIT_ACCESS(PIR2,6)
// IPR2<DMA1ORIP>
extern volatile __bit                   DMA1ORIP            __at(0x2506);	// @ (0x4A0 * 8 + 6)
#define                                 DMA1ORIP_bit        _BIT_ACCESS(IPR2,6)
// DMA1PR<DMA1PR0>
extern volatile __bit                   DMA1PR0             __at(0x5B0);	// @ (0xB6 * 8 + 0)
#define                                 DMA1PR0_bit         _BIT_ACCESS(DMA1PR,0)
// DMA1PR<DMA1PR1>
extern volatile __bit                   DMA1PR1             __at(0x5B1);	// @ (0xB6 * 8 + 1)
#define                                 DMA1PR1_bit         _BIT_ACCESS(DMA1PR,1)
// DMA1PR<DMA1PR2>
extern volatile __bit                   DMA1PR2             __at(0x5B2);	// @ (0xB6 * 8 + 2)
#define                                 DMA1PR2_bit         _BIT_ACCESS(DMA1PR,2)
// PIE2<DMA1SCNTIE>
extern volatile __bit                   DMA1SCNTIE          __at(0x2564);	// @ (0x4AC * 8 + 4)
#define                                 DMA1SCNTIE_bit      _BIT_ACCESS(PIE2,4)
// PIR2<DMA1SCNTIF>
extern volatile __bit                   DMA1SCNTIF          __at(0x25C4);	// @ (0x4B8 * 8 + 4)
#define                                 DMA1SCNTIF_bit      _BIT_ACCESS(PIR2,4)
// IPR2<DMA1SCNTIP>
extern volatile __bit                   DMA1SCNTIP          __at(0x2504);	// @ (0x4A0 * 8 + 4)
#define                                 DMA1SCNTIP_bit      _BIT_ACCESS(IPR2,4)
// PIE6<DMA2AIE>
extern volatile __bit                   DMA2AIE             __at(0x2587);	// @ (0x4B0 * 8 + 7)
#define                                 DMA2AIE_bit         _BIT_ACCESS(PIE6,7)
