garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q24.h
extern volatile __bit                   SCANHADR11          __at(0x1AF3);	// @ (0x35E * 8 + 3)
#define                                 SCANHADR11_bit      _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x1AF4);	// @ (0x35E * 8 + 4)
#define                                 SCANHADR12_bit      _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x1AF5);	// @ (0x35E * 8 + 5)
#define                                 SCANHADR13_bit      _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x1AF6);	// @ (0x35E * 8 + 6)
#define                                 SCANHADR14_bit      _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<SCANHADR15>
extern volatile __bit                   SCANHADR15          __at(0x1AF7);	// @ (0x35E * 8 + 7)
#define                                 SCANHADR15_bit      _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<SCANHADR16>
extern volatile __bit                   SCANHADR16          __at(0x1AF8);	// @ (0x35F * 8 + 0)
#define                                 SCANHADR16_bit      _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<SCANHADR17>
extern volatile __bit                   SCANHADR17          __at(0x1AF9);	// @ (0x35F * 8 + 1)
#define                                 SCANHADR17_bit      _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<SCANHADR18>
extern volatile __bit                   SCANHADR18          __at(0x1AFA);	// @ (0x35F * 8 + 2)
#define                                 SCANHADR18_bit      _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<SCANHADR19>
extern volatile __bit                   SCANHADR19          __at(0x1AFB);	// @ (0x35F * 8 + 3)
#define                                 SCANHADR19_bit      _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<SCANHADR2>
extern volatile __bit                   SCANHADR2           __at(0x1AEA);	// @ (0x35D * 8 + 2)
#define                                 SCANHADR2_bit       _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<SCANHADR20>
extern volatile __bit                   SCANHADR20          __at(0x1AFC);	// @ (0x35F * 8 + 4)
#define                                 SCANHADR20_bit      _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<SCANHADR21>
extern volatile __bit                   SCANHADR21          __at(0x1AFD);	// @ (0x35F * 8 + 5)
#define                                 SCANHADR21_bit      _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<SCANHADR3>
extern volatile __bit                   SCANHADR3           __at(0x1AEB);	// @ (0x35D * 8 + 3)
#define                                 SCANHADR3_bit       _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<SCANHADR4>
extern volatile __bit                   SCANHADR4           __at(0x1AEC);	// @ (0x35D * 8 + 4)
#define                                 SCANHADR4_bit       _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<SCANHADR5>
extern volatile __bit                   SCANHADR5           __at(0x1AED);	// @ (0x35D * 8 + 5)
#define                                 SCANHADR5_bit       _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<SCANHADR6>
extern volatile __bit                   SCANHADR6           __at(0x1AEE);	// @ (0x35D * 8 + 6)
#define                                 SCANHADR6_bit       _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<SCANHADR7>
extern volatile __bit                   SCANHADR7           __at(0x1AEF);	// @ (0x35D * 8 + 7)
#define                                 SCANHADR7_bit       _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<SCANHADR8>
extern volatile __bit                   SCANHADR8           __at(0x1AF0);	// @ (0x35E * 8 + 0)
#define                                 SCANHADR8_bit       _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<SCANHADR9>
extern volatile __bit                   SCANHADR9           __at(0x1AF1);	// @ (0x35E * 8 + 1)
#define                                 SCANHADR9_bit       _BIT_ACCESS(SCANHADRH,1)
// PIE8<SCANIE>
extern volatile __bit                   SCANIE              __at(0x2597);	// @ (0x4B2 * 8 + 7)
#define                                 SCANIE_bit          _BIT_ACCESS(PIE8,7)
// PIR8<SCANIF>
extern volatile __bit                   SCANIF              __at(0x25F7);	// @ (0x4BE * 8 + 7)
#define                                 SCANIF_bit          _BIT_ACCESS(PIR8,7)
// IPR8<SCANIP>
extern volatile __bit                   SCANIP              __at(0x2537);	// @ (0x4A6 * 8 + 7)
#define                                 SCANIP_bit          _BIT_ACCESS(IPR8,7)
// SCANLADRL<SCANLADR0>
extern volatile __bit                   SCANLADR0           __at(0x1AD0);	// @ (0x35A * 8 + 0)
#define                                 SCANLADR0_bit       _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<SCANLADR1>
extern volatile __bit                   SCANLADR1           __at(0x1AD1);	// @ (0x35A * 8 + 1)
#define                                 SCANLADR1_bit       _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<SCANLADR10>
extern volatile __bit                   SCANLADR10          __at(0x1ADA);	// @ (0x35B * 8 + 2)
#define                                 SCANLADR10_bit      _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<SCANLADR11>
extern volatile __bit                   SCANLADR11          __at(0x1ADB);	// @ (0x35B * 8 + 3)
#define                                 SCANLADR11_bit      _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<SCANLADR12>
extern volatile __bit                   SCANLADR12          __at(0x1ADC);	// @ (0x35B * 8 + 4)
#define                                 SCANLADR12_bit      _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<SCANLADR13>
extern volatile __bit                   SCANLADR13          __at(0x1ADD);	// @ (0x35B * 8 + 5)
#define                                 SCANLADR13_bit      _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<SCANLADR14>
extern volatile __bit                   SCANLADR14          __at(0x1ADE);	// @ (0x35B * 8 + 6)
#define                                 SCANLADR14_bit      _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<SCANLADR15>
extern volatile __bit                   SCANLADR15          __at(0x1ADF);	// @ (0x35B * 8 + 7)
#define                                 SCANLADR15_bit      _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<SCANLADR16>
extern volatile __bit                   SCANLADR16          __at(0x1AE0);	// @ (0x35C * 8 + 0)
#define                                 SCANLADR16_bit      _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<SCANLADR17>
extern volatile __bit                   SCANLADR17          __at(0x1AE1);	// @ (0x35C * 8 + 1)
#define                                 SCANLADR17_bit      _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<SCANLADR18>
extern volatile __bit                   SCANLADR18          __at(0x1AE2);	// @ (0x35C * 8 + 2)
#define                                 SCANLADR18_bit      _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<SCANLADR19>
extern volatile __bit                   SCANLADR19          __at(0x1AE3);	// @ (0x35C * 8 + 3)
#define                                 SCANLADR19_bit      _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<SCANLADR2>
extern volatile __bit                   SCANLADR2           __at(0x1AD2);	// @ (0x35A * 8 + 2)
#define                                 SCANLADR2_bit       _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<SCANLADR20>
extern volatile __bit                   SCANLADR20          __at(0x1AE4);	// @ (0x35C * 8 + 4)
#define                                 SCANLADR20_bit      _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<SCANLADR21>
extern volatile __bit                   SCANLADR21          __at(0x1AE5);	// @ (0x35C * 8 + 5)
#define                                 SCANLADR21_bit      _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<SCANLADR3>
extern volatile __bit                   SCANLADR3           __at(0x1AD3);	// @ (0x35A * 8 + 3)
#define                                 SCANLADR3_bit       _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<SCANLADR4>
extern volatile __bit                   SCANLADR4           __at(0x1AD4);	// @ (0x35A * 8 + 4)
#define                                 SCANLADR4_bit       _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<SCANLADR5>
extern volatile __bit                   SCANLADR5           __at(0x1AD5);	// @ (0x35A * 8 + 5)
#define                                 SCANLADR5_bit       _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<SCANLADR6>
extern volatile __bit                   SCANLADR6           __at(0x1AD6);	// @ (0x35A * 8 + 6)
#define                                 SCANLADR6_bit       _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<SCANLADR7>
extern volatile __bit                   SCANLADR7           __at(0x1AD7);	// @ (0x35A * 8 + 7)
#define                                 SCANLADR7_bit       _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<SCANLADR8>
extern volatile __bit                   SCANLADR8           __at(0x1AD8);	// @ (0x35B * 8 + 0)
#define                                 SCANLADR8_bit       _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<SCANLADR9>
extern volatile __bit                   SCANLADR9           __at(0x1AD9);	// @ (0x35B * 8 + 1)
#define                                 SCANLADR9_bit       _BIT_ACCESS(SCANLADRH,1)
// PMD0<SCANMD>
extern volatile __bit                   SCANMD              __at(0x313);	// @ (0x62 * 8 + 3)
#define                                 SCANMD_bit          _BIT_ACCESS(PMD0,3)
// SCANPR<SCANPR0>
extern volatile __bit                   SCANPR0             __at(0x5A8);	// @ (0xB5 * 8 + 0)
#define                                 SCANPR0_bit         _BIT_ACCESS(SCANPR,0)
// SCANPR<SCANPR1>
extern volatile __bit                   SCANPR1             __at(0x5A9);	// @ (0xB5 * 8 + 1)
#define                                 SCANPR1_bit         _BIT_ACCESS(SCANPR,1)
// SCANPR<SCANPR2>
extern volatile __bit                   SCANPR2             __at(0x5AA);	// @ (0xB5 * 8 + 2)
#define                                 SCANPR2_bit         _BIT_ACCESS(SCANPR,2)
// DMAnSCNTL<SCNT0>
extern volatile __bit                   SCNT0               __at(0x788);	// @ (0xF1 * 8 + 0)
#define                                 SCNT0_bit           _BIT_ACCESS(DMAnSCNTL,0)
// DMAnSCNTL<SCNT1>
extern volatile __bit                   SCNT1               __at(0x789);	// @ (0xF1 * 8 + 1)
#define                                 SCNT1_bit           _BIT_ACCESS(DMAnSCNTL,1)
// DMAnSCNTH<SCNT10>
extern volatile __bit                   SCNT10              __at(0x792);	// @ (0xF2 * 8 + 2)
#define                                 SCNT10_bit          _BIT_ACCESS(DMAnSCNTH,2)
// DMAnSCNTH<SCNT11>
extern volatile __bit                   SCNT11              __at(0x793);	// @ (0xF2 * 8 + 3)
#define                                 SCNT11_bit          _BIT_ACCESS(DMAnSCNTH,3)
// DMAnSCNTL<SCNT2>
extern volatile __bit                   SCNT2               __at(0x78A);	// @ (0xF1 * 8 + 2)
#define                                 SCNT2_bit           _BIT_ACCESS(DMAnSCNTL,2)
// DMAnSCNTL<SCNT3>
extern volatile __bit                   SCNT3               __at(0x78B);	// @ (0xF1 * 8 + 3)
#define                                 SCNT3_bit           _BIT_ACCESS(DMAnSCNTL,3)
// DMAnSCNTL<SCNT4>
extern volatile __bit                   SCNT4               __at(0x78C);	// @ (0xF1 * 8 + 4)
#define                                 SCNT4_bit           _BIT_ACCESS(DMAnSCNTL,4)
// DMAnSCNTL<SCNT5>
extern volatile __bit                   SCNT5               __at(0x78D);	// @ (0xF1 * 8 + 5)
#define                                 SCNT5_bit           _BIT_ACCESS(DMAnSCNTL,5)
// DMAnSCNTL<SCNT6>
extern volatile __bit                   SCNT6               __at(0x78E);	// @ (0xF1 * 8 + 6)
#define                                 SCNT6_bit           _BIT_ACCESS(DMAnSCNTL,6)
// DMAnSCNTL<SCNT7>
extern volatile __bit                   SCNT7               __at(0x78F);	// @ (0xF1 * 8 + 7)
#define                                 SCNT7_bit           _BIT_ACCESS(DMAnSCNTL,7)
// DMAnSCNTH<SCNT8>
extern volatile __bit                   SCNT8               __at(0x790);	// @ (0xF2 * 8 + 0)
#define                                 SCNT8_bit           _BIT_ACCESS(DMAnSCNTH,0)
// DMAnSCNTH<SCNT9>
extern volatile __bit                   SCNT9               __at(0x791);	// @ (0xF2 * 8 + 1)
#define                                 SCNT9_bit           _BIT_ACCESS(DMAnSCNTH,1)
// WDTCON0<SEN>
extern volatile __bit                   SEN                 __at(0x3C0);	// @ (0x78 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(WDTCON0,0)
// CRCCON0<SETUP0>
extern volatile __bit                   SETUP0              __at(0x1AB2);	// @ (0x356 * 8 + 2)
#define                                 SETUP0_bit          _BIT_ACCESS(CRCCON0,2)
// CRCCON0<SETUP1>
extern volatile __bit                   SETUP1              __at(0x1AB3);	// @ (0x356 * 8 + 3)
#define                                 SETUP1_bit          _BIT_ACCESS(CRCCON0,3)
// SCANCON0<SGO>
extern volatile __bit                   SGO                 __at(0x1B05);	// @ (0x360 * 8 + 5)
#define                                 SGO_bit             _BIT_ACCESS(SCANCON0,5)
// SHADCON<SHADLO>
extern volatile __bit                   SHADLO              __at(0x1BB0);	// @ (0x376 * 8 + 0)
#define                                 SHADLO_bit          _BIT_ACCESS(SHADCON,0)
// CRCSHFTL<SHIFT0>
extern volatile __bit                   SHIFT0              __at(0x1A90);	// @ (0x352 * 8 + 0)
#define                                 SHIFT0_bit          _BIT_ACCESS(CRCSHFTL,0)
// CRCSHFTL<SHIFT1>
extern volatile __bit                   SHIFT1              __at(0x1A91);	// @ (0x352 * 8 + 1)
#define                                 SHIFT1_bit          _BIT_ACCESS(CRCSHFTL,1)
// CRCSHFTH<SHIFT10>
extern volatile __bit                   SHIFT10             __at(0x1A9A);	// @ (0x353 * 8 + 2)
#define                                 SHIFT10_bit         _BIT_ACCESS(CRCSHFTH,2)
// CRCSHFTH<SHIFT11>
extern volatile __bit                   SHIFT11             __at(0x1A9B);	// @ (0x353 * 8 + 3)
#define                                 SHIFT11_bit         _BIT_ACCESS(CRCSHFTH,3)
// CRCSHFTH<SHIFT12>
extern volatile __bit                   SHIFT12             __at(0x1A9C);	// @ (0x353 * 8 + 4)
#define                                 SHIFT12_bit         _BIT_ACCESS(CRCSHFTH,4)
// CRCSHFTH<SHIFT13>
extern volatile __bit                   SHIFT13             __at(0x1A9D);	// @ (0x353 * 8 + 5)
#define                                 SHIFT13_bit         _BIT_ACCESS(CRCSHFTH,5)
// CRCSHFTH<SHIFT14>
extern volatile __bit                   SHIFT14             __at(0x1A9E);	// @ (0x353 * 8 + 6)
#define                                 SHIFT14_bit         _BIT_ACCESS(CRCSHFTH,6)
// CRCSHFTH<SHIFT15>
extern volatile __bit                   SHIFT15             __at(0x1A9F);	// @ (0x353 * 8 + 7)
#define                                 SHIFT15_bit         _BIT_ACCESS(CRCSHFTH,7)
// CRCSHFTU<SHIFT16>
extern volatile __bit                   SHIFT16             __at(0x1AA0);	// @ (0x354 * 8 + 0)
#define                                 SHIFT16_bit         _BIT_ACCESS(CRCSHFTU,0)
// CRCSHFTU<SHIFT17>
extern volatile __bit                   SHIFT17             __at(0x1AA1);	// @ (0x354 * 8 + 1)
#define                                 SHIFT17_bit         _BIT_ACCESS(CRCSHFTU,1)
// CRCSHFTU<SHIFT18>
extern volatile __bit                   SHIFT18             __at(0x1AA2);	// @ (0x354 * 8 + 2)
#define                                 SHIFT18_bit         _BIT_ACCESS(CRCSHFTU,2)
// CRCSHFTU<SHIFT19>
extern volatile __bit                   SHIFT19             __at(0x1AA3);	// @ (0x354 * 8 + 3)
#define                                 SHIFT19_bit         _BIT_ACCESS(CRCSHFTU,3)
// CRCSHFTL<SHIFT2>
extern volatile __bit                   SHIFT2              __at(0x1A92);	// @ (0x352 * 8 + 2)
#define                                 SHIFT2_bit          _BIT_ACCESS(CRCSHFTL,2)
// CRCSHFTU<SHIFT20>
extern volatile __bit                   SHIFT20             __at(0x1AA4);	// @ (0x354 * 8 + 4)
#define                                 SHIFT20_bit         _BIT_ACCESS(CRCSHFTU,4)
// CRCSHFTU<SHIFT21>
extern volatile __bit                   SHIFT21             __at(0x1AA5);	// @ (0x354 * 8 + 5)
#define                                 SHIFT21_bit         _BIT_ACCESS(CRCSHFTU,5)
// CRCSHFTU<SHIFT22>
extern volatile __bit                   SHIFT22             __at(0x1AA6);	// @ (0x354 * 8 + 6)
#define                                 SHIFT22_bit         _BIT_ACCESS(CRCSHFTU,6)
// CRCSHFTU<SHIFT23>
extern volatile __bit                   SHIFT23             __at(0x1AA7);	// @ (0x354 * 8 + 7)
#define                                 SHIFT23_bit         _BIT_ACCESS(CRCSHFTU,7)
// CRCSHFTT<SHIFT24>
extern volatile __bit                   SHIFT24             __at(0x1AA8);	// @ (0x355 * 8 + 0)
#define                                 SHIFT24_bit         _BIT_ACCESS(CRCSHFTT,0)
// CRCSHFTT<SHIFT25>
extern volatile __bit                   SHIFT25             __at(0x1AA9);	// @ (0x355 * 8 + 1)
#define                                 SHIFT25_bit         _BIT_ACCESS(CRCSHFTT,1)
// CRCSHFTT<SHIFT26>
extern volatile __bit                   SHIFT26             __at(0x1AAA);	// @ (0x355 * 8 + 2)
#define                                 SHIFT26_bit         _BIT_ACCESS(CRCSHFTT,2)
// CRCSHFTT<SHIFT27>
extern volatile __bit                   SHIFT27             __at(0x1AAB);	// @ (0x355 * 8 + 3)
#define                                 SHIFT27_bit         _BIT_ACCESS(CRCSHFTT,3)
// CRCSHFTT<SHIFT28>
extern volatile __bit                   SHIFT28             __at(0x1AAC);	// @ (0x355 * 8 + 4)
#define                                 SHIFT28_bit         _BIT_ACCESS(CRCSHFTT,4)
// CRCSHFTT<SHIFT29>
extern volatile __bit                   SHIFT29             __at(0x1AAD);	// @ (0x355 * 8 + 5)
#define                                 SHIFT29_bit         _BIT_ACCESS(CRCSHFTT,5)
// CRCSHFTL<SHIFT3>
extern volatile __bit                   SHIFT3              __at(0x1A93);	// @ (0x352 * 8 + 3)
#define                                 SHIFT3_bit          _BIT_ACCESS(CRCSHFTL,3)
// CRCSHFTT<SHIFT30>
extern volatile __bit                   SHIFT30             __at(0x1AAE);	// @ (0x355 * 8 + 6)
#define                                 SHIFT30_bit         _BIT_ACCESS(CRCSHFTT,6)
// CRCSHFTT<SHIFT31>
extern volatile __bit                   SHIFT31             __at(0x1AAF);	// @ (0x355 * 8 + 7)
#define                                 SHIFT31_bit         _BIT_ACCESS(CRCSHFTT,7)
// CRCSHFTL<SHIFT4>
extern volatile __bit                   SHIFT4              __at(0x1A94);	// @ (0x352 * 8 + 4)
#define                                 SHIFT4_bit          _BIT_ACCESS(CRCSHFTL,4)
// CRCSHFTL<SHIFT5>
extern volatile __bit                   SHIFT5              __at(0x1A95);	// @ (0x352 * 8 + 5)
#define                                 SHIFT5_bit          _BIT_ACCESS(CRCSHFTL,5)
// CRCSHFTL<SHIFT6>
extern volatile __bit                   SHIFT6              __at(0x1A96);	// @ (0x352 * 8 + 6)
#define                                 SHIFT6_bit          _BIT_ACCESS(CRCSHFTL,6)
// CRCSHFTL<SHIFT7>
extern volatile __bit                   SHIFT7              __at(0x1A97);	// @ (0x352 * 8 + 7)
#define                                 SHIFT7_bit          _BIT_ACCESS(CRCSHFTL,7)
// CRCSHFTH<SHIFT8>
extern volatile __bit                   SHIFT8              __at(0x1A98);	// @ (0x353 * 8 + 0)
#define                                 SHIFT8_bit          _BIT_ACCESS(CRCSHFTH,0)
// CRCSHFTH<SHIFT9>
extern volatile __bit                   SHIFT9              __at(0x1A99);	// @ (0x353 * 8 + 1)
#define                                 SHIFT9_bit          _BIT_ACCESS(CRCSHFTH,1)
// CRCCON0<SHIFTM>
extern volatile __bit                   SHIFTM              __at(0x1AB1);	// @ (0x356 * 8 + 1)
#define                                 SHIFTM_bit          _BIT_ACCESS(CRCCON0,1)
// CWG1AS0<SHUTDOWN>
extern volatile __bit                   SHUTDOWN            __at(0x1E17);	// @ (0x3C2 * 8 + 7)
#define                                 SHUTDOWN_bit        _BIT_ACCESS(CWG1AS0,7)
// DMAnSIRQ<SIRQ0>
extern volatile __bit                   SIRQ0               __at(0x7F0);	// @ (0xFE * 8 + 0)
#define                                 SIRQ0_bit           _BIT_ACCESS(DMAnSIRQ,0)
// DMAnSIRQ<SIRQ1>
extern volatile __bit                   SIRQ1               __at(0x7F1);	// @ (0xFE * 8 + 1)
#define                                 SIRQ1_bit           _BIT_ACCESS(DMAnSIRQ,1)
// DMAnSIRQ<SIRQ2>
extern volatile __bit                   SIRQ2               __at(0x7F2);	// @ (0xFE * 8 + 2)
#define                                 SIRQ2_bit           _BIT_ACCESS(DMAnSIRQ,2)
// DMAnSIRQ<SIRQ3>
extern volatile __bit                   SIRQ3               __at(0x7F3);	// @ (0xFE * 8 + 3)
#define                                 SIRQ3_bit           _BIT_ACCESS(DMAnSIRQ,3)
// DMAnSIRQ<SIRQ4>
extern volatile __bit                   SIRQ4               __at(0x7F4);	// @ (0xFE * 8 + 4)
#define                                 SIRQ4_bit           _BIT_ACCESS(DMAnSIRQ,4)
// DMAnSIRQ<SIRQ5>
extern volatile __bit                   SIRQ5               __at(0x7F5);	// @ (0xFE * 8 + 5)
#define                                 SIRQ5_bit           _BIT_ACCESS(DMAnSIRQ,5)
// DMAnSIRQ<SIRQ6>
extern volatile __bit                   SIRQ6               __at(0x7F6);	// @ (0xFE * 8 + 6)
#define                                 SIRQ6_bit           _BIT_ACCESS(DMAnSIRQ,6)
// DMAnSIRQ<SIRQ7>
extern volatile __bit                   SIRQ7               __at(0x7F7);	// @ (0xFE * 8 + 7)
#define                                 SIRQ7_bit           _BIT_ACCESS(DMAnSIRQ,7)
// DMAnCON0<SIRQEN>
extern volatile __bit                   SIRQEN              __at(0x7DE);	// @ (0xFB * 8 + 6)
#define                                 SIRQEN_bit          _BIT_ACCESS(DMAnCON0,6)
// CLCSELECT<SLCT2>
extern volatile __bit                   SLCT2               __at(0x6AA);	// @ (0xD5 * 8 + 2)
#define                                 SLCT2_bit           _BIT_ACCESS(CLCSELECT,2)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0x2018);	// @ (0x403 * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0x2019);	// @ (0x403 * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0x201A);	// @ (0x403 * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA3>
extern volatile __bit                   SLRA3               __at(0x201B);	// @ (0x403 * 8 + 3)
#define                                 SLRA3_bit           _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0x201C);	// @ (0x403 * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0x201D);	// @ (0x403 * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRA6>
extern volatile __bit                   SLRA6               __at(0x201E);	// @ (0x403 * 8 + 6)
#define                                 SLRA6_bit           _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRA7>
extern volatile __bit                   SLRA7               __at(0x201F);	// @ (0x403 * 8 + 7)
#define                                 SLRA7_bit           _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRB0>
extern volatile __bit                   SLRB0               __at(0x2058);	// @ (0x40B * 8 + 0)
#define                                 SLRB0_bit           _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRB1>
extern volatile __bit                   SLRB1               __at(0x2059);	// @ (0x40B * 8 + 1)
#define                                 SLRB1_bit           _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRB2>
extern volatile __bit                   SLRB2               __at(0x205A);	// @ (0x40B * 8 + 2)
#define                                 SLRB2_bit           _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRB3>
