garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q24.h
extern volatile __bit                   SLRB3               __at(0x205B);	// @ (0x40B * 8 + 3)
#define                                 SLRB3_bit           _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRB4>
extern volatile __bit                   SLRB4               __at(0x205C);	// @ (0x40B * 8 + 4)
#define                                 SLRB4_bit           _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRB5>
extern volatile __bit                   SLRB5               __at(0x205D);	// @ (0x40B * 8 + 5)
#define                                 SLRB5_bit           _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRB6>
extern volatile __bit                   SLRB6               __at(0x205E);	// @ (0x40B * 8 + 6)
#define                                 SLRB6_bit           _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRB7>
extern volatile __bit                   SLRB7               __at(0x205F);	// @ (0x40B * 8 + 7)
#define                                 SLRB7_bit           _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0x2098);	// @ (0x413 * 8 + 0)
#define                                 SLRC0_bit           _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0x2099);	// @ (0x413 * 8 + 1)
#define                                 SLRC1_bit           _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0x209A);	// @ (0x413 * 8 + 2)
#define                                 SLRC2_bit           _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRC3>
extern volatile __bit                   SLRC3               __at(0x209B);	// @ (0x413 * 8 + 3)
#define                                 SLRC3_bit           _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRC4>
extern volatile __bit                   SLRC4               __at(0x209C);	// @ (0x413 * 8 + 4)
#define                                 SLRC4_bit           _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRC5>
extern volatile __bit                   SLRC5               __at(0x209D);	// @ (0x413 * 8 + 5)
#define                                 SLRC5_bit           _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRC6>
extern volatile __bit                   SLRC6               __at(0x209E);	// @ (0x413 * 8 + 6)
#define                                 SLRC6_bit           _BIT_ACCESS(SLRCONC,6)
// SLRCOND<SLRD0>
extern volatile __bit                   SLRD0               __at(0x20D8);	// @ (0x41B * 8 + 0)
#define                                 SLRD0_bit           _BIT_ACCESS(SLRCOND,0)
// SLRCOND<SLRD1>
extern volatile __bit                   SLRD1               __at(0x20D9);	// @ (0x41B * 8 + 1)
#define                                 SLRD1_bit           _BIT_ACCESS(SLRCOND,1)
// SLRCOND<SLRD2>
extern volatile __bit                   SLRD2               __at(0x20DA);	// @ (0x41B * 8 + 2)
#define                                 SLRD2_bit           _BIT_ACCESS(SLRCOND,2)
// SLRCOND<SLRD3>
extern volatile __bit                   SLRD3               __at(0x20DB);	// @ (0x41B * 8 + 3)
#define                                 SLRD3_bit           _BIT_ACCESS(SLRCOND,3)
// SLRCOND<SLRD4>
extern volatile __bit                   SLRD4               __at(0x20DC);	// @ (0x41B * 8 + 4)
#define                                 SLRD4_bit           _BIT_ACCESS(SLRCOND,4)
// SLRCOND<SLRD5>
extern volatile __bit                   SLRD5               __at(0x20DD);	// @ (0x41B * 8 + 5)
#define                                 SLRD5_bit           _BIT_ACCESS(SLRCOND,5)
// SLRCOND<SLRD6>
extern volatile __bit                   SLRD6               __at(0x20DE);	// @ (0x41B * 8 + 6)
#define                                 SLRD6_bit           _BIT_ACCESS(SLRCOND,6)
// SLRCOND<SLRD7>
extern volatile __bit                   SLRD7               __at(0x20DF);	// @ (0x41B * 8 + 7)
#define                                 SLRD7_bit           _BIT_ACCESS(SLRCOND,7)
// SLRCONE<SLRE0>
extern volatile __bit                   SLRE0               __at(0x2118);	// @ (0x423 * 8 + 0)
#define                                 SLRE0_bit           _BIT_ACCESS(SLRCONE,0)
// SLRCONE<SLRE1>
extern volatile __bit                   SLRE1               __at(0x2119);	// @ (0x423 * 8 + 1)
#define                                 SLRE1_bit           _BIT_ACCESS(SLRCONE,1)
// SLRCONE<SLRE2>
extern volatile __bit                   SLRE2               __at(0x211A);	// @ (0x423 * 8 + 2)
#define                                 SLRE2_bit           _BIT_ACCESS(SLRCONE,2)
// ADCON3<SOI>
extern volatile __bit                   SOI                 __at(0x1FB3);	// @ (0x3F6 * 8 + 3)
#define                                 SOI_bit             _BIT_ACCESS(ADCON3,3)
// OSCSTAT<SOR>
extern volatile __bit                   SOR                 __at(0x593);	// @ (0xB2 * 8 + 3)
#define                                 SOR_bit             _BIT_ACCESS(OSCSTAT,3)
// OSCEN<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x59B);	// @ (0xB3 * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(OSCEN,3)
// OSCCON3<SOSCPWR>
extern volatile __bit                   SOSCPWR             __at(0x57E);	// @ (0xAF * 8 + 6)
#define                                 SOSCPWR_bit         _BIT_ACCESS(OSCCON3,6)
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x27E2);	// @ (0x4FC * 8 + 2)
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x27E3);	// @ (0x4FC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x27E4);	// @ (0x4FC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// STKPTR<SP5>
extern volatile __bit                   SP5                 __at(0x27E5);	// @ (0x4FC * 8 + 5)
#define                                 SP5_bit             _BIT_ACCESS(STKPTR,5)
// STKPTR<SP6>
extern volatile __bit                   SP6                 __at(0x27E6);	// @ (0x4FC * 8 + 6)
#define                                 SP6_bit             _BIT_ACCESS(STKPTR,6)
// SPI1CON0<SPI1BMODE>
extern volatile __bit                   SPI1BMODE           __at(0x420);	// @ (0x84 * 8 + 0)
#define                                 SPI1BMODE_bit       _BIT_ACCESS(SPI1CON0,0)
// SPI1CON2<SPI1BUSY>
extern volatile __bit                   SPI1BUSY            __at(0x437);	// @ (0x86 * 8 + 7)
#define                                 SPI1BUSY_bit        _BIT_ACCESS(SPI1CON2,7)
// SPI1CON1<SPI1CKE>
extern volatile __bit                   SPI1CKE             __at(0x42E);	// @ (0x85 * 8 + 6)
#define                                 SPI1CKE_bit         _BIT_ACCESS(SPI1CON1,6)
// SPI1CON1<SPI1CKP>
extern volatile __bit                   SPI1CKP             __at(0x42D);	// @ (0x85 * 8 + 5)
#define                                 SPI1CKP_bit         _BIT_ACCESS(SPI1CON1,5)
// SPI1CLK<SPI1CLKSEL0>
extern volatile __bit                   SPI1CLKSEL0         __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 SPI1CLKSEL0_bit     _BIT_ACCESS(SPI1CLK,0)
// SPI1CLK<SPI1CLKSEL1>
extern volatile __bit                   SPI1CLKSEL1         __at(0x461);	// @ (0x8C * 8 + 1)
#define                                 SPI1CLKSEL1_bit     _BIT_ACCESS(SPI1CLK,1)
// SPI1CLK<SPI1CLKSEL2>
extern volatile __bit                   SPI1CLKSEL2         __at(0x462);	// @ (0x8C * 8 + 2)
#define                                 SPI1CLKSEL2_bit     _BIT_ACCESS(SPI1CLK,2)
// SPI1CLK<SPI1CLKSEL3>
extern volatile __bit                   SPI1CLKSEL3         __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 SPI1CLKSEL3_bit     _BIT_ACCESS(SPI1CLK,3)
// SPI1CLK<SPI1CLKSEL4>
extern volatile __bit                   SPI1CLKSEL4         __at(0x464);	// @ (0x8C * 8 + 4)
#define                                 SPI1CLKSEL4_bit     _BIT_ACCESS(SPI1CLK,4)
// SPI1STATUS<SPI1CLRBF>
extern volatile __bit                   SPI1CLRBF           __at(0x43A);	// @ (0x87 * 8 + 2)
#define                                 SPI1CLRBF_bit       _BIT_ACCESS(SPI1STATUS,2)
// SPI1INTE<SPI1EOSIE>
extern volatile __bit                   SPI1EOSIE           __at(0x45C);	// @ (0x8B * 8 + 4)
#define                                 SPI1EOSIE_bit       _BIT_ACCESS(SPI1INTE,4)
// SPI1INTF<SPI1EOSIF>
extern volatile __bit                   SPI1EOSIF           __at(0x454);	// @ (0x8A * 8 + 4)
#define                                 SPI1EOSIF_bit       _BIT_ACCESS(SPI1INTF,4)
// SPI1CON1<SPI1FST>
extern volatile __bit                   SPI1FST             __at(0x42C);	// @ (0x85 * 8 + 4)
#define                                 SPI1FST_bit         _BIT_ACCESS(SPI1CON1,4)
// PIE3<SPI1IE>
extern volatile __bit                   SPI1IE              __at(0x256A);	// @ (0x4AD * 8 + 2)
#define                                 SPI1IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<SPI1IF>
extern volatile __bit                   SPI1IF              __at(0x25CA);	// @ (0x4B9 * 8 + 2)
#define                                 SPI1IF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<SPI1IP>
extern volatile __bit                   SPI1IP              __at(0x250A);	// @ (0x4A1 * 8 + 2)
#define                                 SPI1IP_bit          _BIT_ACCESS(IPR3,2)
// SPI1CON0<SPI1LSBF>
extern volatile __bit                   SPI1LSBF            __at(0x422);	// @ (0x84 * 8 + 2)
#define                                 SPI1LSBF_bit        _BIT_ACCESS(SPI1CON0,2)
// PMD3<SPI1MD>
extern volatile __bit                   SPI1MD              __at(0x32C);	// @ (0x65 * 8 + 4)
#define                                 SPI1MD_bit          _BIT_ACCESS(PMD3,4)
// SPI1CON0<SPI1MST>
extern volatile __bit                   SPI1MST             __at(0x421);	// @ (0x84 * 8 + 1)
#define                                 SPI1MST_bit         _BIT_ACCESS(SPI1CON0,1)
// SPI1STATUS<SPI1RXBF>
extern volatile __bit                   SPI1RXBF            __at(0x438);	// @ (0x87 * 8 + 0)
#define                                 SPI1RXBF_bit        _BIT_ACCESS(SPI1STATUS,0)
// PIE3<SPI1RXIE>
extern volatile __bit                   SPI1RXIE            __at(0x2568);	// @ (0x4AD * 8 + 0)
#define                                 SPI1RXIE_bit        _BIT_ACCESS(PIE3,0)
// PIR3<SPI1RXIF>
extern volatile __bit                   SPI1RXIF            __at(0x25C8);	// @ (0x4B9 * 8 + 0)
#define                                 SPI1RXIF_bit        _BIT_ACCESS(PIR3,0)
// IPR3<SPI1RXIP>
extern volatile __bit                   SPI1RXIP            __at(0x2508);	// @ (0x4A1 * 8 + 0)
#define                                 SPI1RXIP_bit        _BIT_ACCESS(IPR3,0)
// SPI1INTE<SPI1RXOIE>
extern volatile __bit                   SPI1RXOIE           __at(0x45A);	// @ (0x8B * 8 + 2)
#define                                 SPI1RXOIE_bit       _BIT_ACCESS(SPI1INTE,2)
// SPI1INTF<SPI1RXOIF>
extern volatile __bit                   SPI1RXOIF           __at(0x452);	// @ (0x8A * 8 + 2)
#define                                 SPI1RXOIF_bit       _BIT_ACCESS(SPI1INTF,2)
// SPI1CON2<SPI1RXR>
extern volatile __bit                   SPI1RXR             __at(0x430);	// @ (0x86 * 8 + 0)
#define                                 SPI1RXR_bit         _BIT_ACCESS(SPI1CON2,0)
// SPI1STATUS<SPI1RXRE>
extern volatile __bit                   SPI1RXRE            __at(0x43B);	// @ (0x87 * 8 + 3)
#define                                 SPI1RXRE_bit        _BIT_ACCESS(SPI1STATUS,3)
// SPI1SCKPPS<SPI1SCKPPS0>
extern volatile __bit                   SPI1SCKPPS0         __at(0x1350);	// @ (0x26A * 8 + 0)
#define                                 SPI1SCKPPS0_bit     _BIT_ACCESS(SPI1SCKPPS,0)
// SPI1SCKPPS<SPI1SCKPPS1>
extern volatile __bit                   SPI1SCKPPS1         __at(0x1351);	// @ (0x26A * 8 + 1)
#define                                 SPI1SCKPPS1_bit     _BIT_ACCESS(SPI1SCKPPS,1)
// SPI1SCKPPS<SPI1SCKPPS2>
extern volatile __bit                   SPI1SCKPPS2         __at(0x1352);	// @ (0x26A * 8 + 2)
#define                                 SPI1SCKPPS2_bit     _BIT_ACCESS(SPI1SCKPPS,2)
// SPI1SCKPPS<SPI1SCKPPS3>
extern volatile __bit                   SPI1SCKPPS3         __at(0x1353);	// @ (0x26A * 8 + 3)
#define                                 SPI1SCKPPS3_bit     _BIT_ACCESS(SPI1SCKPPS,3)
// SPI1SCKPPS<SPI1SCKPPS4>
extern volatile __bit                   SPI1SCKPPS4         __at(0x1354);	// @ (0x26A * 8 + 4)
#define                                 SPI1SCKPPS4_bit     _BIT_ACCESS(SPI1SCKPPS,4)
// SPI1SCKPPS<SPI1SCKPPS5>
extern volatile __bit                   SPI1SCKPPS5         __at(0x1355);	// @ (0x26A * 8 + 5)
#define                                 SPI1SCKPPS5_bit     _BIT_ACCESS(SPI1SCKPPS,5)
// SPI1CON1<SPI1SDIP>
extern volatile __bit                   SPI1SDIP            __at(0x429);	// @ (0x85 * 8 + 1)
#define                                 SPI1SDIP_bit        _BIT_ACCESS(SPI1CON1,1)
// SPI1SDIPPS<SPI1SDIPPS0>
extern volatile __bit                   SPI1SDIPPS0         __at(0x1358);	// @ (0x26B * 8 + 0)
#define                                 SPI1SDIPPS0_bit     _BIT_ACCESS(SPI1SDIPPS,0)
// SPI1SDIPPS<SPI1SDIPPS1>
extern volatile __bit                   SPI1SDIPPS1         __at(0x1359);	// @ (0x26B * 8 + 1)
#define                                 SPI1SDIPPS1_bit     _BIT_ACCESS(SPI1SDIPPS,1)
// SPI1SDIPPS<SPI1SDIPPS2>
extern volatile __bit                   SPI1SDIPPS2         __at(0x135A);	// @ (0x26B * 8 + 2)
#define                                 SPI1SDIPPS2_bit     _BIT_ACCESS(SPI1SDIPPS,2)
// SPI1SDIPPS<SPI1SDIPPS3>
extern volatile __bit                   SPI1SDIPPS3         __at(0x135B);	// @ (0x26B * 8 + 3)
#define                                 SPI1SDIPPS3_bit     _BIT_ACCESS(SPI1SDIPPS,3)
// SPI1SDIPPS<SPI1SDIPPS4>
extern volatile __bit                   SPI1SDIPPS4         __at(0x135C);	// @ (0x26B * 8 + 4)
#define                                 SPI1SDIPPS4_bit     _BIT_ACCESS(SPI1SDIPPS,4)
// SPI1SDIPPS<SPI1SDIPPS5>
extern volatile __bit                   SPI1SDIPPS5         __at(0x135D);	// @ (0x26B * 8 + 5)
#define                                 SPI1SDIPPS5_bit     _BIT_ACCESS(SPI1SDIPPS,5)
// SPI1CON1<SPI1SDOP>
extern volatile __bit                   SPI1SDOP            __at(0x428);	// @ (0x85 * 8 + 0)
#define                                 SPI1SDOP_bit        _BIT_ACCESS(SPI1CON1,0)
// SPI1CON1<SPI1SMP>
extern volatile __bit                   SPI1SMP             __at(0x42F);	// @ (0x85 * 8 + 7)
#define                                 SPI1SMP_bit         _BIT_ACCESS(SPI1CON1,7)
// SPI1INTE<SPI1SOSIE>
extern volatile __bit                   SPI1SOSIE           __at(0x45D);	// @ (0x8B * 8 + 5)
#define                                 SPI1SOSIE_bit       _BIT_ACCESS(SPI1INTE,5)
// SPI1INTF<SPI1SOSIF>
extern volatile __bit                   SPI1SOSIF           __at(0x455);	// @ (0x8A * 8 + 5)
#define                                 SPI1SOSIF_bit       _BIT_ACCESS(SPI1INTF,5)
// SPI1CON0<SPI1SPIEN>
extern volatile __bit                   SPI1SPIEN           __at(0x427);	// @ (0x84 * 8 + 7)
#define                                 SPI1SPIEN_bit       _BIT_ACCESS(SPI1CON0,7)
// SPI1INTE<SPI1SRMTIE>
extern volatile __bit                   SPI1SRMTIE          __at(0x45F);	// @ (0x8B * 8 + 7)
#define                                 SPI1SRMTIE_bit      _BIT_ACCESS(SPI1INTE,7)
// SPI1INTF<SPI1SRMTIF>
extern volatile __bit                   SPI1SRMTIF          __at(0x457);	// @ (0x8A * 8 + 7)
#define                                 SPI1SRMTIF_bit      _BIT_ACCESS(SPI1INTF,7)
// SPI1CON2<SPI1SSET>
extern volatile __bit                   SPI1SSET            __at(0x432);	// @ (0x86 * 8 + 2)
#define                                 SPI1SSET_bit        _BIT_ACCESS(SPI1CON2,2)
// SPI1CON2<SPI1SSFLT>
extern volatile __bit                   SPI1SSFLT           __at(0x436);	// @ (0x86 * 8 + 6)
#define                                 SPI1SSFLT_bit       _BIT_ACCESS(SPI1CON2,6)
// SPI1CON1<SPI1SSP>
extern volatile __bit                   SPI1SSP             __at(0x42A);	// @ (0x85 * 8 + 2)
#define                                 SPI1SSP_bit         _BIT_ACCESS(SPI1CON1,2)
// SPI1SSPPS<SPI1SSPPS0>
extern volatile __bit                   SPI1SSPPS0          __at(0x1360);	// @ (0x26C * 8 + 0)
#define                                 SPI1SSPPS0_bit      _BIT_ACCESS(SPI1SSPPS,0)
// SPI1SSPPS<SPI1SSPPS1>
extern volatile __bit                   SPI1SSPPS1          __at(0x1361);	// @ (0x26C * 8 + 1)
#define                                 SPI1SSPPS1_bit      _BIT_ACCESS(SPI1SSPPS,1)
// SPI1SSPPS<SPI1SSPPS2>
extern volatile __bit                   SPI1SSPPS2          __at(0x1362);	// @ (0x26C * 8 + 2)
#define                                 SPI1SSPPS2_bit      _BIT_ACCESS(SPI1SSPPS,2)
// SPI1SSPPS<SPI1SSPPS3>
extern volatile __bit                   SPI1SSPPS3          __at(0x1363);	// @ (0x26C * 8 + 3)
#define                                 SPI1SSPPS3_bit      _BIT_ACCESS(SPI1SSPPS,3)
// SPI1SSPPS<SPI1SSPPS4>
extern volatile __bit                   SPI1SSPPS4          __at(0x1364);	// @ (0x26C * 8 + 4)
#define                                 SPI1SSPPS4_bit      _BIT_ACCESS(SPI1SSPPS,4)
// SPI1SSPPS<SPI1SSPPS5>
extern volatile __bit                   SPI1SSPPS5          __at(0x1365);	// @ (0x26C * 8 + 5)
#define                                 SPI1SSPPS5_bit      _BIT_ACCESS(SPI1SSPPS,5)
// SPI1INTE<SPI1TCZIE>
extern volatile __bit                   SPI1TCZIE           __at(0x45E);	// @ (0x8B * 8 + 6)
#define                                 SPI1TCZIE_bit       _BIT_ACCESS(SPI1INTE,6)
// SPI1INTF<SPI1TCZIF>
extern volatile __bit                   SPI1TCZIF           __at(0x456);	// @ (0x8A * 8 + 6)
#define                                 SPI1TCZIF_bit       _BIT_ACCESS(SPI1INTF,6)
// SPI1STATUS<SPI1TXBE>
extern volatile __bit                   SPI1TXBE            __at(0x43D);	// @ (0x87 * 8 + 5)
#define                                 SPI1TXBE_bit        _BIT_ACCESS(SPI1STATUS,5)
// PIE3<SPI1TXIE>
extern volatile __bit                   SPI1TXIE            __at(0x2569);	// @ (0x4AD * 8 + 1)
#define                                 SPI1TXIE_bit        _BIT_ACCESS(PIE3,1)
// PIR3<SPI1TXIF>
extern volatile __bit                   SPI1TXIF            __at(0x25C9);	// @ (0x4B9 * 8 + 1)
#define                                 SPI1TXIF_bit        _BIT_ACCESS(PIR3,1)
// IPR3<SPI1TXIP>
extern volatile __bit                   SPI1TXIP            __at(0x2509);	// @ (0x4A1 * 8 + 1)
#define                                 SPI1TXIP_bit        _BIT_ACCESS(IPR3,1)
// SPI1CON2<SPI1TXR>
extern volatile __bit                   SPI1TXR             __at(0x431);	// @ (0x86 * 8 + 1)
#define                                 SPI1TXR_bit         _BIT_ACCESS(SPI1CON2,1)
// SPI1INTE<SPI1TXUIE>
extern volatile __bit                   SPI1TXUIE           __at(0x459);	// @ (0x8B * 8 + 1)
#define                                 SPI1TXUIE_bit       _BIT_ACCESS(SPI1INTE,1)
// SPI1INTF<SPI1TXUIF>
extern volatile __bit                   SPI1TXUIF           __at(0x451);	// @ (0x8A * 8 + 1)
#define                                 SPI1TXUIF_bit       _BIT_ACCESS(SPI1INTF,1)
// SPI1STATUS<SPI1TXWE>
extern volatile __bit                   SPI1TXWE            __at(0x43F);	// @ (0x87 * 8 + 7)
#define                                 SPI1TXWE_bit        _BIT_ACCESS(SPI1STATUS,7)
// SPI2CON0<SPI2BMODE>
extern volatile __bit                   SPI2BMODE           __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 SPI2BMODE_bit       _BIT_ACCESS(SPI2CON0,0)
// SPI2CON2<SPI2BUSY>
extern volatile __bit                   SPI2BUSY            __at(0x49F);	// @ (0x93 * 8 + 7)
#define                                 SPI2BUSY_bit        _BIT_ACCESS(SPI2CON2,7)
// SPI2CON1<SPI2CKE>
extern volatile __bit                   SPI2CKE             __at(0x496);	// @ (0x92 * 8 + 6)
#define                                 SPI2CKE_bit         _BIT_ACCESS(SPI2CON1,6)
// SPI2CON1<SPI2CKP>
extern volatile __bit                   SPI2CKP             __at(0x495);	// @ (0x92 * 8 + 5)
#define                                 SPI2CKP_bit         _BIT_ACCESS(SPI2CON1,5)
// SPI2CLK<SPI2CLKSEL0>
extern volatile __bit                   SPI2CLKSEL0         __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SPI2CLKSEL0_bit     _BIT_ACCESS(SPI2CLK,0)
// SPI2CLK<SPI2CLKSEL1>
extern volatile __bit                   SPI2CLKSEL1         __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SPI2CLKSEL1_bit     _BIT_ACCESS(SPI2CLK,1)
// SPI2CLK<SPI2CLKSEL2>
extern volatile __bit                   SPI2CLKSEL2         __at(0x4CA);	// @ (0x99 * 8 + 2)
#define                                 SPI2CLKSEL2_bit     _BIT_ACCESS(SPI2CLK,2)
// SPI2CLK<SPI2CLKSEL3>
extern volatile __bit                   SPI2CLKSEL3         __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 SPI2CLKSEL3_bit     _BIT_ACCESS(SPI2CLK,3)
// SPI2CLK<SPI2CLKSEL4>
extern volatile __bit                   SPI2CLKSEL4         __at(0x4CC);	// @ (0x99 * 8 + 4)
#define                                 SPI2CLKSEL4_bit     _BIT_ACCESS(SPI2CLK,4)
// SPI2STATUS<SPI2CLRBF>
extern volatile __bit                   SPI2CLRBF           __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 SPI2CLRBF_bit       _BIT_ACCESS(SPI2STATUS,2)
// SPI2INTE<SPI2EOSIE>
extern volatile __bit                   SPI2EOSIE           __at(0x4C4);	// @ (0x98 * 8 + 4)
#define                                 SPI2EOSIE_bit       _BIT_ACCESS(SPI2INTE,4)
// SPI2INTF<SPI2EOSIF>
extern volatile __bit                   SPI2EOSIF           __at(0x4BC);	// @ (0x97 * 8 + 4)
#define                                 SPI2EOSIF_bit       _BIT_ACCESS(SPI2INTF,4)
// SPI2CON1<SPI2FST>
extern volatile __bit                   SPI2FST             __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 SPI2FST_bit         _BIT_ACCESS(SPI2CON1,4)
// PIE11<SPI2IE>
extern volatile __bit                   SPI2IE              __at(0x25AA);	// @ (0x4B5 * 8 + 2)
#define                                 SPI2IE_bit          _BIT_ACCESS(PIE11,2)
// PIR11<SPI2IF>
extern volatile __bit                   SPI2IF              __at(0x260A);	// @ (0x4C1 * 8 + 2)
#define                                 SPI2IF_bit          _BIT_ACCESS(PIR11,2)
// IPR11<SPI2IP>
extern volatile __bit                   SPI2IP              __at(0x254A);	// @ (0x4A9 * 8 + 2)
#define                                 SPI2IP_bit          _BIT_ACCESS(IPR11,2)
// SPI2CON0<SPI2LSBF>
extern volatile __bit                   SPI2LSBF            __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 SPI2LSBF_bit        _BIT_ACCESS(SPI2CON0,2)
// PMD3<SPI2MD>
extern volatile __bit                   SPI2MD              __at(0x32D);	// @ (0x65 * 8 + 5)
#define                                 SPI2MD_bit          _BIT_ACCESS(PMD3,5)
// SPI2CON0<SPI2MST>
extern volatile __bit                   SPI2MST             __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 SPI2MST_bit         _BIT_ACCESS(SPI2CON0,1)
// SPI2STATUS<SPI2RXBF>
extern volatile __bit                   SPI2RXBF            __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 SPI2RXBF_bit        _BIT_ACCESS(SPI2STATUS,0)
// PIE11<SPI2RXIE>
extern volatile __bit                   SPI2RXIE            __at(0x25A8);	// @ (0x4B5 * 8 + 0)
#define                                 SPI2RXIE_bit        _BIT_ACCESS(PIE11,0)
// PIR11<SPI2RXIF>
extern volatile __bit                   SPI2RXIF            __at(0x2608);	// @ (0x4C1 * 8 + 0)
#define                                 SPI2RXIF_bit        _BIT_ACCESS(PIR11,0)
// IPR11<SPI2RXIP>
extern volatile __bit                   SPI2RXIP            __at(0x2548);	// @ (0x4A9 * 8 + 0)
