garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q24.h
#define                                 TMR18_bit           _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR19>
extern volatile __bit                   TMR19               __at(0x1899);	// @ (0x313 * 8 + 1)
#define                                 TMR19_bit           _BIT_ACCESS(TMR1H,1)
// PIE3<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x256D);	// @ (0x4AD * 8 + 5)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE3,5)
// PIR3<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x25CD);	// @ (0x4B9 * 8 + 5)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR3,5)
// IPR3<TMR1GIP>
extern volatile __bit                   TMR1GIP             __at(0x250D);	// @ (0x4A1 * 8 + 5)
#define                                 TMR1GIP_bit         _BIT_ACCESS(IPR3,5)
// TMR1H<TMR1H0>
extern volatile __bit                   TMR1H0              __at(0x1898);	// @ (0x313 * 8 + 0)
#define                                 TMR1H0_bit          _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR1H1>
extern volatile __bit                   TMR1H1              __at(0x1899);	// @ (0x313 * 8 + 1)
#define                                 TMR1H1_bit          _BIT_ACCESS(TMR1H,1)
// TMR1H<TMR1H2>
extern volatile __bit                   TMR1H2              __at(0x189A);	// @ (0x313 * 8 + 2)
#define                                 TMR1H2_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR1H3>
extern volatile __bit                   TMR1H3              __at(0x189B);	// @ (0x313 * 8 + 3)
#define                                 TMR1H3_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR1H4>
extern volatile __bit                   TMR1H4              __at(0x189C);	// @ (0x313 * 8 + 4)
#define                                 TMR1H4_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR1H5>
extern volatile __bit                   TMR1H5              __at(0x189D);	// @ (0x313 * 8 + 5)
#define                                 TMR1H5_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR1H6>
extern volatile __bit                   TMR1H6              __at(0x189E);	// @ (0x313 * 8 + 6)
#define                                 TMR1H6_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR1H7>
extern volatile __bit                   TMR1H7              __at(0x189F);	// @ (0x313 * 8 + 7)
#define                                 TMR1H7_bit          _BIT_ACCESS(TMR1H,7)
// PIE3<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x256C);	// @ (0x4AD * 8 + 4)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x25CC);	// @ (0x4B9 * 8 + 4)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TMR1IP>
extern volatile __bit                   TMR1IP              __at(0x250C);	// @ (0x4A1 * 8 + 4)
#define                                 TMR1IP_bit          _BIT_ACCESS(IPR3,4)
// TMR1L<TMR1L0>
extern volatile __bit                   TMR1L0              __at(0x1890);	// @ (0x312 * 8 + 0)
#define                                 TMR1L0_bit          _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR1L1>
extern volatile __bit                   TMR1L1              __at(0x1891);	// @ (0x312 * 8 + 1)
#define                                 TMR1L1_bit          _BIT_ACCESS(TMR1L,1)
// TMR1L<TMR1L2>
extern volatile __bit                   TMR1L2              __at(0x1892);	// @ (0x312 * 8 + 2)
#define                                 TMR1L2_bit          _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR1L3>
extern volatile __bit                   TMR1L3              __at(0x1893);	// @ (0x312 * 8 + 3)
#define                                 TMR1L3_bit          _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR1L4>
extern volatile __bit                   TMR1L4              __at(0x1894);	// @ (0x312 * 8 + 4)
#define                                 TMR1L4_bit          _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR1L5>
extern volatile __bit                   TMR1L5              __at(0x1895);	// @ (0x312 * 8 + 5)
#define                                 TMR1L5_bit          _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR1L6>
extern volatile __bit                   TMR1L6              __at(0x1896);	// @ (0x312 * 8 + 6)
#define                                 TMR1L6_bit          _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR1L7>
extern volatile __bit                   TMR1L7              __at(0x1897);	// @ (0x312 * 8 + 7)
#define                                 TMR1L7_bit          _BIT_ACCESS(TMR1L,7)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x319);	// @ (0x63 * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x18A0);	// @ (0x314 * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE3<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x256B);	// @ (0x4AD * 8 + 3)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x25CB);	// @ (0x4B9 * 8 + 3)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<TMR2IP>
extern volatile __bit                   TMR2IP              __at(0x250B);	// @ (0x4A1 * 8 + 3)
#define                                 TMR2IP_bit          _BIT_ACCESS(IPR3,3)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x31A);	// @ (0x63 * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x18FF);	// @ (0x31F * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// TMR3L<TMR30>
extern volatile __bit                   TMR30               __at(0x1918);	// @ (0x323 * 8 + 0)
#define                                 TMR30_bit           _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR31>
extern volatile __bit                   TMR31               __at(0x1919);	// @ (0x323 * 8 + 1)
#define                                 TMR31_bit           _BIT_ACCESS(TMR3L,1)
// TMR3H<TMR310>
extern volatile __bit                   TMR310              __at(0x1922);	// @ (0x324 * 8 + 2)
#define                                 TMR310_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR311>
extern volatile __bit                   TMR311              __at(0x1923);	// @ (0x324 * 8 + 3)
#define                                 TMR311_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR312>
extern volatile __bit                   TMR312              __at(0x1924);	// @ (0x324 * 8 + 4)
#define                                 TMR312_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR313>
extern volatile __bit                   TMR313              __at(0x1925);	// @ (0x324 * 8 + 5)
#define                                 TMR313_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR314>
extern volatile __bit                   TMR314              __at(0x1926);	// @ (0x324 * 8 + 6)
#define                                 TMR314_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR315>
extern volatile __bit                   TMR315              __at(0x1927);	// @ (0x324 * 8 + 7)
#define                                 TMR315_bit          _BIT_ACCESS(TMR3H,7)
// TMR3L<TMR32>
extern volatile __bit                   TMR32               __at(0x191A);	// @ (0x323 * 8 + 2)
#define                                 TMR32_bit           _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR33>
extern volatile __bit                   TMR33               __at(0x191B);	// @ (0x323 * 8 + 3)
#define                                 TMR33_bit           _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR34>
extern volatile __bit                   TMR34               __at(0x191C);	// @ (0x323 * 8 + 4)
#define                                 TMR34_bit           _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR35>
extern volatile __bit                   TMR35               __at(0x191D);	// @ (0x323 * 8 + 5)
#define                                 TMR35_bit           _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR36>
extern volatile __bit                   TMR36               __at(0x191E);	// @ (0x323 * 8 + 6)
#define                                 TMR36_bit           _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR37>
extern volatile __bit                   TMR37               __at(0x191F);	// @ (0x323 * 8 + 7)
#define                                 TMR37_bit           _BIT_ACCESS(TMR3L,7)
// TMR3H<TMR38>
extern volatile __bit                   TMR38               __at(0x1920);	// @ (0x324 * 8 + 0)
#define                                 TMR38_bit           _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR39>
extern volatile __bit                   TMR39               __at(0x1921);	// @ (0x324 * 8 + 1)
#define                                 TMR39_bit           _BIT_ACCESS(TMR3H,1)
// PIE4<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x2575);	// @ (0x4AE * 8 + 5)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE4,5)
// PIR4<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x25D5);	// @ (0x4BA * 8 + 5)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR4,5)
// IPR4<TMR3GIP>
extern volatile __bit                   TMR3GIP             __at(0x2515);	// @ (0x4A2 * 8 + 5)
#define                                 TMR3GIP_bit         _BIT_ACCESS(IPR4,5)
// TMR3H<TMR3H0>
extern volatile __bit                   TMR3H0              __at(0x1920);	// @ (0x324 * 8 + 0)
#define                                 TMR3H0_bit          _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR3H1>
extern volatile __bit                   TMR3H1              __at(0x1921);	// @ (0x324 * 8 + 1)
#define                                 TMR3H1_bit          _BIT_ACCESS(TMR3H,1)
// TMR3H<TMR3H2>
extern volatile __bit                   TMR3H2              __at(0x1922);	// @ (0x324 * 8 + 2)
#define                                 TMR3H2_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR3H3>
extern volatile __bit                   TMR3H3              __at(0x1923);	// @ (0x324 * 8 + 3)
#define                                 TMR3H3_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR3H4>
extern volatile __bit                   TMR3H4              __at(0x1924);	// @ (0x324 * 8 + 4)
#define                                 TMR3H4_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR3H5>
extern volatile __bit                   TMR3H5              __at(0x1925);	// @ (0x324 * 8 + 5)
#define                                 TMR3H5_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR3H6>
extern volatile __bit                   TMR3H6              __at(0x1926);	// @ (0x324 * 8 + 6)
#define                                 TMR3H6_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR3H7>
extern volatile __bit                   TMR3H7              __at(0x1927);	// @ (0x324 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE4<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x2574);	// @ (0x4AE * 8 + 4)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x25D4);	// @ (0x4BA * 8 + 4)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x2514);	// @ (0x4A2 * 8 + 4)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR4,4)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x1918);	// @ (0x323 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x1919);	// @ (0x323 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x191A);	// @ (0x323 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x191B);	// @ (0x323 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x191C);	// @ (0x323 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x191D);	// @ (0x323 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x191E);	// @ (0x323 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x191F);	// @ (0x323 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x31B);	// @ (0x63 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x1928);	// @ (0x325 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE10<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x25A3);	// @ (0x4B4 * 8 + 3)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE10,3)
// PIR10<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x2603);	// @ (0x4C0 * 8 + 3)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR10,3)
// IPR10<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x2543);	// @ (0x4A8 * 8 + 3)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR10,3)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x31C);	// @ (0x63 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x1967);	// @ (0x32C * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// PIE5<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x257B);	// @ (0x4AF * 8 + 3)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE5,3)
// PIR5<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x25DB);	// @ (0x4BB * 8 + 3)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR5,3)
// IPR5<TMR6IP>
extern volatile __bit                   TMR6IP              __at(0x251B);	// @ (0x4A3 * 8 + 3)
#define                                 TMR6IP_bit          _BIT_ACCESS(IPR5,3)
// PMD1<TMR6MD>
extern volatile __bit                   TMR6MD              __at(0x31D);	// @ (0x63 * 8 + 5)
#define                                 TMR6MD_bit          _BIT_ACCESS(PMD1,5)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x199F);	// @ (0x333 * 8 + 7)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,7)
// TU16ACON1<TMRAOSEN>
extern volatile __bit                   TMRAOSEN            __at(0x1CF6);	// @ (0x39E * 8 + 6)
#define                                 TMRAOSEN_bit        _BIT_ACCESS(TU16ACON1,6)
// TU16BCON1<TMRBOSEN>
extern volatile __bit                   TMRBOSEN            __at(0x1D66);	// @ (0x3AC * 8 + 6)
#define                                 TMRBOSEN_bit        _BIT_ACCESS(TU16BCON1,6)
// SCANCON0<TRIGEN>
extern volatile __bit                   TRIGEN              __at(0x1B06);	// @ (0x360 * 8 + 6)
#define                                 TRIGEN_bit          _BIT_ACCESS(SCANCON0,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0xA40);	// @ (0x148 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0xA41);	// @ (0x148 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0xA42);	// @ (0x148 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0xA43);	// @ (0x148 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0xA44);	// @ (0x148 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0xA45);	// @ (0x148 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0xA46);	// @ (0x148 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0xA47);	// @ (0x148 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0xA48);	// @ (0x149 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0xA49);	// @ (0x149 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0xA4A);	// @ (0x149 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0xA4B);	// @ (0x149 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0xA4C);	// @ (0x149 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0xA4D);	// @ (0x149 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0xA4E);	// @ (0x149 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0xA4F);	// @ (0x149 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0xA50);	// @ (0x14A * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0xA51);	// @ (0x14A * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0xA52);	// @ (0x14A * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0xA53);	// @ (0x14A * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0xA54);	// @ (0x14A * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0xA55);	// @ (0x14A * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0xA56);	// @ (0x14A * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0xA57);	// @ (0x14A * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// SCANTRIG<TSEL0>
extern volatile __bit                   TSEL0               __at(0x1B08);	// @ (0x361 * 8 + 0)
#define                                 TSEL0_bit           _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<TSEL1>
extern volatile __bit                   TSEL1               __at(0x1B09);	// @ (0x361 * 8 + 1)
#define                                 TSEL1_bit           _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<TSEL2>
extern volatile __bit                   TSEL2               __at(0x1B0A);	// @ (0x361 * 8 + 2)
#define                                 TSEL2_bit           _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<TSEL3>
extern volatile __bit                   TSEL3               __at(0x1B0B);	// @ (0x361 * 8 + 3)
#define                                 TSEL3_bit           _BIT_ACCESS(SCANTRIG,3)
// SCANTRIG<TSEL4>
extern volatile __bit                   TSEL4               __at(0x1B0C);	// @ (0x361 * 8 + 4)
#define                                 TSEL4_bit           _BIT_ACCESS(SCANTRIG,4)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x1EBD);	// @ (0x3D7 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x1EBC);	// @ (0x3D7 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// TU16ACON1<TU16ACAPT>
extern volatile __bit                   TU16ACAPT           __at(0x1CF3);	// @ (0x39E * 8 + 3)
#define                                 TU16ACAPT_bit       _BIT_ACCESS(TU16ACON1,3)
// TU16ACON0<TU16ACIE>
extern volatile __bit                   TU16ACIE            __at(0x1CE8);	// @ (0x39D * 8 + 0)
#define                                 TU16ACIE_bit        _BIT_ACCESS(TU16ACON0,0)
// TU16ACON1<TU16ACIF>
extern volatile __bit                   TU16ACIF            __at(0x1CF0);	// @ (0x39E * 8 + 0)
#define                                 TU16ACIF_bit        _BIT_ACCESS(TU16ACON1,0)
// TU16ACLK<TU16ACLK0>
extern volatile __bit                   TU16ACLK0           __at(0x1D48);	// @ (0x3A9 * 8 + 0)
#define                                 TU16ACLK0_bit       _BIT_ACCESS(TU16ACLK,0)
// TU16ACLK<TU16ACLK1>
extern volatile __bit                   TU16ACLK1           __at(0x1D49);	// @ (0x3A9 * 8 + 1)
#define                                 TU16ACLK1_bit       _BIT_ACCESS(TU16ACLK,1)
// TU16ACLK<TU16ACLK2>
extern volatile __bit                   TU16ACLK2           __at(0x1D4A);	// @ (0x3A9 * 8 + 2)
#define                                 TU16ACLK2_bit       _BIT_ACCESS(TU16ACLK,2)
// TU16ACLK<TU16ACLK3>
extern volatile __bit                   TU16ACLK3           __at(0x1D4B);	// @ (0x3A9 * 8 + 3)
#define                                 TU16ACLK3_bit       _BIT_ACCESS(TU16ACLK,3)
// TU16ACLK<TU16ACLK4>
extern volatile __bit                   TU16ACLK4           __at(0x1D4C);	// @ (0x3A9 * 8 + 4)
#define                                 TU16ACLK4_bit       _BIT_ACCESS(TU16ACLK,4)
// TU16ACON1<TU16ACLR>
extern volatile __bit                   TU16ACLR            __at(0x1CF5);	// @ (0x39E * 8 + 5)
#define                                 TU16ACLR_bit        _BIT_ACCESS(TU16ACON1,5)
// TU16ACON0<TU16ACPOL>
extern volatile __bit                   TU16ACPOL           __at(0x1CEE);	// @ (0x39D * 8 + 6)
